#version: 0.2
- -
-- --
---- ----
Ġ t
-------- --------
i n
Ġ a
Ġt h
= =
e r
o n
r e
---------------- ----------------
Ġ w
Ġ o
a t
e n
Ġ s
Ġth e
Ġ c
n d
a r
o r
e s
== ==
i t
in g
o u
Ġ in
Ġ b
a n
a l
Ġ f
Ġt o
i s
Ġ p
Ġ m
i on
Ġo f
r o
Ġa nd
s t
e d
Ġ d
Ġw e
en t
Ġ A
l l
Ġ g
u r
o m
i c
Ġ y
Ġ I
Ġ h
Ġ re
==== ====
Ġ l
c t
Ġth at
v e
a s
l y
Ġ C
e ar
e t
Ġ S
-------------------------------- ----------------
-------------------------------- ------------------------------------------------
Ġ n
Ġy ou
l e
v er
Ġ e
c h
u t
q u
u s
Ġo ur
Ġ on
Ġ T
Ġf or
t h
Ġb e
Ġ is
o w
ar t
i ll
Ġs e
Ġw h
i g
i m
Ġ M
Ġ qu
a y
i d
======== ========
Ġa s
m ent
er s
it h
c e
at ion
u st
Ġ D
Ġc on
Ġ it
Ġs t
Ġa re
' s
es t
Ġp ro
Ġc om
Ġ R
Ġw ith
Ġe x
Ġh a
Ġ W
o l
er e
Ġ [
Ġ -
o o
es s
ĠA nd
Ġm o
r i
p p
Ġ u
v en
a m
u e
Ġd e
i r
at e
i f
Ġy ear
l d
Ġg ro
a d
Ġ 2
Ġa n
e ct
Ġ E
ro m
s e
ĠI n
Ġn e
al ly
Ġa b
Ġ P
Ġf rom
in k
o t
Ġ O
Ġ B
Ġha ve
it y
p er
ou t
Ġ r
ig h
Ġqu art
k e
u ct
or t
i l
Ġth ink
ĠT h
Ġgro w
s s
a b
i ve
u l
Ġ G
Ġth is
g e
Ġquart er
Ġcon t
ĠW e
y st
Ġab out
' re
an t
e l
Ġm ar
al l
Ġa t
a c
Ġs h
Ġex p
Ġ N
Ġ us
u re
Ġw ill
================ ================
a p
d uct
ou ld
ear ch
oo k
om e
e m
ill ion
ĠD i
Ġcom p
Ġ $
u m
Ġu p
Ġin c
a in
Ġ 1
Ġre ven
Ġw as
ust om
a st
i es
Ġmo re
Ġ --
Ġgrow th
ver y
ĠR es
a nd
in ess
ĠS o
us iness
ar d
Ġg o
Ġo r
Ġ j
Ġ2 0
Ġin t
Ġ H
est ion
Ġb usiness
ment s
Ġd o
Ġc ustom
or m
ĠRes earch
Ġ im
Ġth ere
on g
f er
en d
Ġse e
Ġa l
Ġreven ue
a ct
Ġ F
a re
u n
Ġqu estion
Ġpro duct
l o
Ġs o
ĠA n
Ġa d
Ġim p
Ġt r
Ġcont in
per at
ic h
s o
r ou
Ġa c
Ġ &
Ġo ver
h an
e c
Ġ v
Ġj ust
Ġwh at
f orm
Ġb y
p t
Ġs u
o g
al yst
an s
Ġ L
an ce
ĠAn alyst
k et
l i
g in
i p
Ġw or
Ġ 3
Ġst r
Ġexp ect
Ġa ll
ion s
Ġm a
ĠIn c
t s
Ġp o
t er
Ġre s
v ic
Ġs ome
on d
Ġp er
as e
g h
i al
Ġin v
Ġcustom ers
in d
is c
Ġ Q
Ġp l
is ion
Ġwh ich
Ġ very
ir st
Ġn ot
Ġh igh
ation s
Ġc an
Ġb illion
ing s
Ġyou r
a ge
Ġne w
Ġc l
Ġ J
Ġp art
x t
im e
Ġ20 1
at ed
th er
Ġd ri
Ġo ut
Ġse c
o re
v ision
in e
Ġm e
as ed
Ġl i
igh t
Ġmar ket
id e
k s
ĠDi vision
A N
Ġ en
Ġgo ing
Ġt e
re ct
Ġli ke
Ġinc re
' ve
Ġth an
ou d
Ġal so
Ġl ook
en ce
Ġwe ll
Ġa pp
Ġl e
k ing
it ion
i z
Ġmar gin
b er
Ġs er
Ġs p
Ġh ow
Ġne xt
Ġw ould
Ġg u
Ġc all
Ġp re
perat or
ou s
Ġf irst
Ġh as
Ġb ut
Ġn ow
Ġre c
re n
ch n
ĠC E
u d
Ġstr ong
Ġ V
ent er
vic es
is t
w ard
ĠCE O
F O
at a
ol og
Ġbe en
O perator
ou r
Ġ k
f f
an c
chn olog
on e
Ġg re
ĠTh e
i e
Ġth en
Ġre ally
if ic
Ġ if
ab le
Ġthe y
Ġu n
o se
ĠC h
or y
o c
ou n
O N
Ġa g
ac k
ĠDi rect
Ġres ul
ĠM ic
o p
Ġan y
Ġcontin ue
ig n
ĠDirect or
Ġd ata
Ġs a
Ġ Y
Ġinv est
Ġint o
Ġcl oud
Ġl ast
Ġc o
pp ort
Ġt a
Ġt al
Ġm illion
0 0
chnolog y
oo d
re s
er m
' ll
v ing
i le
n ing
an y
Ġsec ond
Ġt ime
en s
i or
it ies
Ġon e
Ġtr ans
y ear
c ri
ro ss
Ġfor ward
c l
Ġb it
Ġwh ere
o th
Ġcontin u
d ay
Ġc ur
yst em
Ġth ose
Ġ U
Ġin d
Ġde m
Ġt erm
ĠS en
rou gh
ĠB ut
H E
f t
or p
ĠSen ior
' t
b e
Ġg et
Ġo ther
e p
c ess
Ġproduct s
Ġc han
r ic
Ġc ap
il ity
e ll
Ġpo in
o ver
Ġ ear
ĠS t
us e
Ġb u
Ġad d
i ous
ĠC FO
Ġw ere
Ġdem and
orp or
e ad
Ġsh are
Ġtal k
it e
am p
Ġ 4
Ġthe ir
Ġresul ts
Ġm ay
ow n
Ġ K
Ġ 5
r y
Ġha d
ver s
Ġre m
Ġth rough
Ġd if
Ġa ct
i ally
id ent
u ch
Ġc ould
r is
et er
Ġbe c
Ġf e
ĠI t
i v
Ġthe se
Ġto day
V I
et w
perat ing
Ġgro ss
Ġwor k
el p
cri pt
Ġwh en
Ġcom m
Ġac ross
Ġh elp
c ed
fer ence
l ook
Ġg ood
nd er
ĠY ou
a il
am e
a ch
g an
Ġcur ren
e f
Ġcon s
it t
Ġimp act
form ance
or s
Ġterm s
a use
Ġb oth
Ġst art
ic s
Ġinc l
A P
Ġre p
a g
ĠS u
Ġd own
ĠA S
i o
u ll
en er
h er
Ġma ke
g r
ec ut
R A
R E
Ġincl ud
ol d
Ġl ine
ĠT HE
it al
Ġgre at
or d
i x
T h
Ġco st
r on
Ġl ot
T han
Ġdif fer
w are
ĠM D
re ss
Ġw ant
A nd
an k
Ġ i
ĠMic ro
ĠC orpor
Ġse g
al f
ĠM ar
Ġpro v
Ġl ong
ay s
ĠC o
l ic
ow er
Ġs ign
Ġb ack
Ġf in
ĠV P
Ġn um
================================ ================
================================ ================================================
ĠE U
t ain
Ġo pport
Ġopport un
oo g
ĠT e
a ce
l er
ou gh
oog le
Ġe very
Ġ end
b le
Ġ 6
rou nd
ĠG oogle
Ġs ay
Ġh alf
ĠCorpor ation
Ġm uch
ystem s
A AP
ad e
P U
oc us
ĠI N
Ġper formance
ĠA pp
ur ing
Ġk ind
ar y
Ġr ight
Ġo perating
VI D
Ġf ocus
ĠA m
as h
Ġ1 0
Ġimp ro
at form
Ġan n
' m
2 0
Ġc h
Ġu nder
Ġst ate
Ġbec ause
ve l
anc ial
o s
Ġc enter
Ġl itt
Ġlitt le
ĠP res
ĠPres ident
at es
Ġgu id
Ġa round
a v
Ġsee ing
Ġre l
v ious
Ġmo d
Ġf l
Ġmo st
ar g
Ġf act
p ris
Ġcustom er
Ġd isc
ĠC ap
Ġcom es
ĠD e
Ġpl atform
Ġcomp ut
Ġas s
p h
ate g
Ġhigh er
er tain
Y es
ĠC om
I ON
L C
Ġdri ven
Ġth ings
Ġi P
ol ut
ĠO ur
RA M
i ly
o ll
as on
I n
ce ler
Ġpoin t
oun t
Ġapp ro
Ġsa id
at ive
ific ant
% .
p ect
b s
i ld
Ġthe m
Ġimp ort
L I
y n
c y
Ġm ix
Ġsign ificant
ĠD RAM
Ġag ain
Ġwor ld
Ġnum ber
Ġf ull
Ġser vices
look ing
ff ic
Ġl a
a k
Ġind ust
Ġact u
ĠTe chnology
AN D
Ġ enter
ur n
Ġde li
Ġof f
ĠW h
al es
ĠN AND
Ġdiffer ent
R I
Ġle vel
Ġp ric
Ġg am
ve lo
ĠTh is
c ent
Ġb as
le ase
Ġm on
Ġn o
Ġk n
e op
Ġc ash
Ġne ed
Ġ 7
ate ly
i re
Ġimport ant
Ġyear s
% ,
ĠA s
Ġ201 9
e ve
Ġte chnology
etw or
oll ow
Ġw ay
ir d
Ġst ill
Ġex per
ul ar
Ġ ro
ĠIn t
pris e
Ġf ollow
ĠE x
Ġsu pp
isc o
r uct
Ġr ate
n o
Ġp ort
Ġguid ance
Ġb ig
Ġpo s
Ġbu ild
Ġo b
un ch
r ap
Ġg ener
Ġbe li
Ġp ri
ĠA l
Ġde velo
ĠApp le
ĠA N
vious ly
ie w
E x
Ġs ales
Ġac celer
Ġb ased
Ġover all
Ġkn ow
eop le
. ,
Ġre al
v ent
an om
Ġr amp
Ġrec ord
Ġchan g
re e
at ing
W e
it ed
Ġta ke
t y
so ft
Ġd es
ĠC O
o b
Ġbeli eve
it s
Ġn on
vic e
Ġla unch
ĠC isco
n ings
ĠA I
Ġsh ould
Ġpart n
O ur
o in
isc al
Ġstate ments
E D
Ġpart ic
Ġp eople
Ġexper i
Ġpro cess
ĠR e
c al
u p
Ġfin ancial
rap h
Ġbe ing
ab ility
em ory
ent ion
Ġl ear
or gan
u es
Ġd on
Ġle ad
m an
Ġann oun
r ans
Ġm an
Ġme an
er n
Ġb r
anom eter
g ress
Ġseg ment
Ġdeli ver
G AAP
ĠInt el
c om
f ul
t r
Ġa ut
ver t
Ġb et
n e
Ġactu ally
Ġdevelo p
an ies
ĠMicro soft
Ġimpro ve
Ġgre w
ĠCom p
u c
lo b
rans cript
ĠG PU
Ġte am
t ing
Ġt re
Ġincre ase
Ġn etwor
E S
Ġapp lic
Ġs ide
Ġpro f
qu ent
ĠMic ron
Ġf iscal
Ġmay be
ĠEU V
Ġinv ent
at er
Ġpri or
h one
Ġtalk ed
l es
ic k
Ġg ive
et her
Ġe ven
iz e
Ġm ention
ol io
f olio
u al
Ġcurren t
Ġindust ry
g th
Ġ ke
age ment
A L
Ġcon st
ĠL LC
le ct
Ġcontinu ed
Ġcomp anies
Than k
Ġport folio
Ġa r
ic al
Ġopportun ity
ĠP C
N T
i ven
E NT
Ġincre ased
I N
n anometer
Ġgrow ing
Ġinclud ing
Ġsupp ly
Ġcom ing
Ġ201 8
a ir
in a
Ġsa w
Ġprov id
Ġenter prise
L E
ul t
Ġso ft
AN Y
an ge
Ġbet ter
v anc
Ġde cl
ter m
c ial
Ġ 9
rou p
Ġpro gress
Ġsp ec
Ġbas is
Ġre g
ure s
t al
form ation
Ġlear ning
Ġmo b
ĠE qu
Ġs l
ecut ive
Ġmention ed
Ġmargin s
im ately
ren gth
it ive
Ġbusiness es
ĠEx ecutive
S C
Ġm emory
R AN
Ġse quent
E C
M L
h ip
Ġst rength
P T
c ur
ĠT RAN
RI PT
SC RIPT
ĠTRAN SCRIPT
ĠA d
Ġc re
A T
Ġ vers
Ġth ird
Ġp r
Ġsu pport
Ġm y
Ġmon th
p le
Ġb en
Ġstr ateg
Ġto tal
lob al
Ġs olut
Ġh ere
Ġinvent ory
Ġincre as
f ore
ĠS ec
Ġse en
Ġsoft ware
Ġmob ile
ur ity
ĠTh at
Ġgam ing
Ġr is
Ġs ort
ĠA P
vanc ed
er cial
Ġc our
Ġen v
Ġre f
ir on
ĠT ranscript
Ġs m
Ġv al
Ġc lo
ow s
Ġass um
Ġenv iron
c on
l ay
st and
b in
Ġm any
ĠI R
Ġinvest ments
a z
Ġre t
Ġcour se
no v
Ġd id
ar ge
Ġsp end
Ġben ef
Ġcon ference
Ġde p
Ġin nov
Ġl et
ĠAS ML
Ġa v
ri an
Ġpoin ts
Ġappro x
Ġcomp et
Ġe m
ĠB ank
Ġper cent
Ġind ic
Ġsh ip
Ġor d
ĠCh ina
Ġtre nd
j ect
en se
Ġd ou
pt ion
Ġannoun ced
ĠS ystems
z ure
Ġinc ome
Ġav ail
Ġapprox imately
M P
Ġpartn ers
Ġob viously
us s
ĠA zure
v ed
Ġp ers
om ent
Ġma king
Ġadd ition
Ġa m
ar ily
Ġd ig
Ġchang es
I A
v es
Ġl arge
Ġexpect ed
Ġrem ain
Ġf our
Ġv iew
Ġm oment
Ġmarket s
ĠiP hone
Ġvers us
Ġ20 20
VID IA
Ġe ff
Ġdri ving
Ġm ade
Ġex ecut
Ġpartic ular
Ġl ower
ion al
Ġpl an
Ġspec ific
Ġcurren cy
Ġmod el
S o
Ġg iven
Ġh e
Ġser vice
Ġcomput ing
I S
ĠB o
Ġrec ent
' d
1 9
er ing
Ġha pp
ic ally
Ġquart ers
Ġcont ent
i b
en c
Ġc ou
lo y
Ġag o
v est
ĠC l
li er
Ġreven ues
Ġdisc uss
Ġdo es
iz ation
O R
ĠR E
vert is
C A
Ġapplic ations
Ġwor king
Ġenviron ment
iz ed
C E
s on
Ġt urn
u be
Ġre ason
ol id
ĠAP P
B LE
ut ure
Ġon ly
ĠO R
Th e
LI CA
ĠCO MP
ĠAPP LICA
ĠCOMP ANY
ĠAPPLICA BLE
T ube
Ġcons um
gr am
ĠCap Ex
Ġs ame
ĠM an
i a
Ġf uture
Ġare as
u nd
ĠN VIDIA
Ġcou ple
Ġcomp any
ĠYou Tube
ĠE P
Ġcomm ercial
Ġquestion s
Ġconst ant
y s
Ġc ertain
Ġr ange
Ġad vertis
Ġfl ow
it ect
ch itect
yn am
Ġgu ess
p l
Ġin f
Ġh ard
Ġval ue
u b
6 5
em s
Ġcontinu es
cal e
Ġint er
Ġear nings
Ġfocus ed
b ut
i ble
Ġcap ac
y p
Ġ201 7
it ions
Ġpro gram
Ġexp and
as s
Ġpr im
Ġin st
ri but
Ġincreas ing
Ġref lect
f ter
re d
is a
ic ip
Ġdo ing
Ġunder stand
Ġear lier
Ġpos ition
h ead
Ġex c
ab et
d u
Ġv ol
Than ks
Ġfe el
re ad
ph abet
Ġs ystems
Ġdri ve
Ġlook ing
ĠIn vest
Ġo p
Ġwe e
ur ch
Ġcom ment
Ġus e
Ġcapac ity
Ġa head
Ġear ly
Ġar chitect
Ġd uring
Ġsec urity
ic e
are d
Ġ 8
Ġpre t
Ġprov ide
ĠComp any
e en
ro ad
is h
om et
Ġser ver
o st
Ġb ase
Ġcap ital
Ġwh ile
Ġab le
t e
Ġ ed
Ġus ers
etw een
Ġbr ing
c i
ar k
ĠS er
az on
Ġpret ty
Ġ ent
Ġb etween
Ġsu bs
ou nd
Ġto ol
ur ities
Ġwh o
Ġcon f
Ġcom e
pt ions
Ġpercent age
B S
Ġa fter
ĠO ffic
Ġm ult
ut h
ĠH ead
Ġavail able
Ġ X
Ġs omet
Ġfour th
Ġsolut ions
al th
res ent
Ġfe w
Ġma ch
y ing
ab ly
ĠH old
oin t
ĠCl oud
b ased
ĠAl phabet
ich a
C h
Ġrep ort
ĠCap ital
Ġmoment um
ĠM organ
Ġsequent ially
Ġdou ble
Ġs ure
ens es
t ime
Ġmo ve
Ġcl ear
ĠAm azon
r ast
s et
Ġb road
an g
art er
Ġpric ing
Ġfact ors
h ing
th ing
iv ity
c ast
Ġde vices
Ġit s
Ġr un
ell y
le y
Ġad o
Ġw ond
Ġexpect ations
ĠAS P
ruct ure
Ġop en
Ġp ut
ĠC all
Ġde c
Ġinvest ment
Ġd ue
ic on
Ġopportun ities
ĠDe vices
Ġexperi ence
Ġprof it
ĠEqu ity
ĠP ro
Ġac c
Ġrel ative
T E
j or
y a
Ġs im
Ġc y
ynam ics
e ly
n ect
o d
ut ers
F E
ĠMar k
rast ructure
w o
ac y
Ġth ough
ĠEU R
ION S
AT ION
Ġ3 65
Ġke y
Ġv ar
ĠO n
Ġexp enses
Ġex amp
ĠU S
ĠHold ing
Ġl arg
re l
Ġb est
Ġma jor
o ther
er r
Ġof fer
Ġris ks
Ġd et
Ġseg ments
Ġprim arily
ĠC ON
Ġex t
Ġun c
Ġinnov ation
Ġc ount
Ġh ead
ĠM A
RE N
T HE
e b
Ġg ot
ĠC AL
FO R
ĠAN Y
ĠAd vanced
FE REN
Ġunc ertain
ĠCAL L
FEREN CE
Ġsu c
Ġp ub
Ġac qu
Ġdes ign
Ġsomet hing
ĠSt an
Ġhe alth
om son
Ġbe gin
ter n
ĠMar ket
ĠRe uters
Ġvol um
Ġto p
Ġn ear
Ġint ro
1 0
Ġt im
Ġs earch
Ġe qu
pp ing
Ġde ep
Ġan other
Ġm id
ĠStan ley
i ed
ation al
Ġwith in
d ig
Ġth ing
ĠI f
ver age
cl ud
Ġus ing
Ġpre ss
Ġoff set
Ġmach ine
e in
li ent
if t
Ġgu ys
Ġf ast
s w
ing le
il ities
Ġtrans ition
ĠSec urities
ĠBo ard
Ġas k
Ġnetwor k
Ġs et
le x
ĠG lobal
ĠCh air
ĠChair man
A C
Ġwe b
ĠP art
Ġchan ge
Ġspend ing
Ġsuc cess
Ġre lease
ĠTh ere
st ein
Ġwh y
Ġget ting
Ġmonth s
1 7
Ġp h
ĠIn st
ĠG roup
h n
n el
at ch
it ch
ind er
Ġo per
Ġse ason
Ġqu ite
cript ion
Ġexamp le
ĠS EC
Ġqu ick
Ġ3 0
Ġaut om
k ay
Ġin formation
raph ics
Ġp ast
Ġd i
ant s
Ġta x
b ers
le ased
ĠO r
ĠTh ank
Ġc ar
Ġcom ments
ĠE V
ĠK r
Ġbenef it
1 8
Ġ '
Ġf ore
Ġassum ptions
in ed
if y
ĠF in
ĠMan agement
b ably
Ġbe fore
Ġ201 6
Ġd one
lo ad
Ġout look
Ġinf rastructure
Ġinter est
Ġb al
Ġproduct ion
Ġeff ect
dig it
Ġwh ether
ri es
Ġplatform s
pect ive
re at
ĠI S
Ġst and
read y
o ve
in es
et s
og raph
Ġme as
Ġchan nel
w ays
Ġp ower
ĠP r
ĠN on
j ay
as es
oc k
Ġpro bably
Ġstrateg y
Ġw a
ĠF irst
Ġacqu is
ĠMarket s
Ġresul t
3 0
Ġt wo
ĠC an
ĠF or
00 0
Ġwe bs
Ġtrend s
m i
o hn
er g
Ġn et
Ġpl ay
ffic i
Ġp lease
ĠC on
Ġun it
Ġent ire
Ġup d
Ġal ways
Ġcontinu ing
N ow
Ġg ain
Ġal ready
og n
Ġen g
Ġco ll
Ġhapp en
Ġse ll
ĠN ow
L isa
o f
o ss
if ied
Ġevery one
Ġdep loy
Ġs ystem
Ġpric e
Ġin s
Ġl ow
ĠW ind
Ġvolum e
Ġwebs ite
M ark
is se
ĠSu isse
Ġwant ed
Ġlevel s
Ġno d
Ġimprove ment
Ġaddition al
Ġre qu
ĠJ ust
ie ld
Ġt arg
an ks
ĠI s
ĠS em
ĠG AAP
act ion
Ġ5 0
1 6
Ġy es
Ġcom bin
em ber
Ġ1 2
ĠL yn
Ġbig g
Ġarchitect ure
icon duct
Ġcertain ly
Ġadvertis ing
t o
ĠH u
ell ig
Ġt yp
Ġc lient
Ġsh ift
Ġreg ard
Ġspecific ally
Ġh ear
Ġup on
P M
ĠS e
Ġe ffici
ĠTh anks
B rian
b ed
on es
Ġre st
Ġf r
ide o
io d
Ġcost s
ap s
end ent
S D
Ġm ight
ĠThe y
Ġclo se
o ber
Ġf ree
ĠI T
Ġsu ch
Ġship ments
ĠWind ows
A s
al s
Ġwork load
ĠSer vices
5 0
Ġpro ject
Ġab ility
Ġsp e
Ġlong er
Ġs cale
Ġp leased
Ġsh i
ip ment
Ġbuild ing
ĠOffic e
l ine
at h
ĠS SD
ver al
Ġcont ribut
Ġconsum er
Ġwond ering
O kay
gin e
Ġpos itive
Ġsl ight
o ing
at ya
Ġf il
ĠiP ad
t op
en cy
ess ional
tr a
Ġdecl ine
1 1
E M
Ġg raphics
ur ther
Ġper iod
Ġrec ogn
a ve
l ess
p ut
Ġ (
Ġl ess
Ġparticular ly
i er
en n
ern stein
du ced
ĠInvest or
am s
Ġexc ited
Ġdet ail
Ġc ore
igh ts
err ill
ĠLyn ch
p oint
Ġse veral
ĠM errill
iv id
Ġlaunch ed
uc k
Ġs ingle
is e
ab ilities
Ġinst all
1 2
in ary
Ġo w
ur ning
Ġhard ware
q tr
t ies
Ġ qtr
Ġint e
ep endent
old man
ĠGPU s
Ġpers pective
p ec
ĠS ach
un e
ĠSem iconduct
ĠSach s
Ġo pt
ĠA G
Ġrel ated
ĠWh at
c le
Ġc al
Ġg e
Ġn orm
Ġbal ance
Ġc ol
Ġre ach
Ġe vent
Ġcap abilities
Ġord ers
Ġinte gr
k es
on om
al y
ut s
Ġado ption
Ġp urch
ĠT H
ĠM e
ĠR ob
ĠW ith
ot ent
Ġinvest ing
Ġret urn
Ġtool s
w h
Ġp otent
Ġm in
am es
ĠO EM
Ġthink ing
ater ially
ĠPr ime
Ġow n
ĠM ac
Ġsm art
Ġsm all
ĠEP S
Ġcol or
O VID
Ġto ward
Ġqu al
ĠR el
R S
y b
ĠB ernstein
Ġpre p
a w
g ether
Ġto gether
ib ility
Ġvar i
S t
Ġad v
Ġlead ing
Ġp ay
Ġl ist
ĠB E
ĠAN D
ES T
l et
Ġ "
ar l
Ġ1 4
Ġfe at
Ġe ach
Ġ4 0
Ġslight ly
Ġf urther
ĠW enn
ĠN e
Ġres p
Ġclo s
Ġwee k
Ġcy cle
ĠWenn ink
er ic
ar ks
c ore
l ed
Ġs ense
ar cl
Ġe v
ĠT O
th ough
Ġit ems
ĠO p
arcl ays
ol ve
all en
ĠH ow
ag es
Ġord er
A m
Ġwe ak
ĠM a
ĠE vent
Ġcur ious
Ġro ad
ĠPart icip
C U
ĠB rian
Ġsh ort
Ġthan k
Ġfl at
ĠRel ations
g oing
Ġto o
Ġd ay
ur al
ly ing
iv es
ĠAm eric
Ġst ore
ven ue
Ġup gr
ist ent
Ġch allen
ruct ions
D E
c ome
o x
w ind
ĠS w
Ġed ge
I LI
M ENT
M ATION
P ON
P RE
R OVID
S ED
V EST
m ay
n ess
ĠA ll
ĠA RE
Ġre duct
ĠO F
ĠO THE
Ġstart ing
ĠIN FOR
ĠIN VEST
IN G
EC IS
cur ate
ĠCON FERENCE
ĠMA DE
ĠEV ENT
CU RA
ĠOTHE R
ĠINFOR MATION
ĠINVEST MENT
ECIS IONS
Ġs it
Ġin it
ab or
in s
Ġis s
Ġex ce
Ġj oin
Ġv ideo
Ġc ent
Ġwith out
Th omson
or ies
es e
it ig
Ġta king
Ġrem arks
Ġindic ates
am er
Ġgener ation
bin s
ĠRob bins
ĠS ur
Ġtr ying
con t
Ġge ograph
ll ar
ch ie
Ġon going
Ġmo ving
Ġdo llar
ron t
enc es
Ġregard ing
I nd
l ing
s ure
y ond
an jay
Ġl ay
end ar
Ġme et
Ġsp ace
ĠSu nd
Ġke ep
Ġuncertain ties
1 5
2 1
P eter
ment al
Ġan sw
Ġhelp ful
Ġtarg et
ober t
Ind ependent
ĠSund ar
d it
re ci
ĠC PU
Ġpl us
Ġun its
Ġre v
et y
Ġte ll
Ġdevelop ers
2 5
Ġa chie
en ced
ac curate
Ġopt im
Ġcal endar
Ġnorm al
B C
l f
Ġde f
Ġtrans cri
ĠFin ancial
T im
Ġm ain
Ġg lobal
Ġe ver
Ġcon nect
ĠIn tern
Ġexecut ion
Ġworkload s
Ġf air
Ġgu ide
Ġl og
Ġappro ach
Ġsignificant ly
Ġupd ate
or rect
Ġare a
Ġsu b
S ure
is s
qu e
ag ing
Ġteam s
Ġs ur
Ġrequ ire
Ġinstall ed
Ġha ving
oth y
ĠE ar
Ġint ellig
eb ook
ĠInst ructions
1 4
y z
Ġm et
ch e
qu arter
Ġad j
Ġhigh l
Ġcompet itive
Ġs olid
Ġf ound
ĠT im
Ġcomp ared
ĠJ une
Ġacquis ition
f act
Ġre fer
Ġbe yond
im inary
Ġdri ver
ĠRe venue
Ġsubs cription
rel iminary
uts che
r ist
u fact
it z
il t
Ġus er
Ġv is
ener ation
ĠASP s
ĠOp Ex
ĠTh ese
ĠJ ames
Ġdevelop ment
Ġpartners hip
Y C
Ġm ac
Ġd ivid
Ġen ab
ĠEP YC
Ġseason al
g eneration
Ġc ateg
Ġor gan
chnolog ies
Ġret ail
Ġem p
1 3
c u
h old
icha el
Ġlarg est
Ġdi rect
ĠIntern et
Ġdivid end
c os
Ġcomm un
Ġman ufact
Ġpers on
Ġdig ital
Ġ es
Ġstart ed
Ġansw er
O n
t a
ĠA ss
et te
ĠO ne
Ġr ates
Ġprofit ability
Ġmeas ures
e x
ers hip
Ġexp ense
ĠJ ohn
ĠU BS
k top
Ġst ep
U BS
ur a
Ġh op
ĠR yz
Ġtal king
Ġcons istent
Ġfore cast
ĠT o
Ġthere fore
ĠQ u
pec ially
Ġf ar
l come
ĠA ct
ĠP eter
Ġsh ow
Ġcomp let
ĠWh ile
in ce
ro p
ver core
Ġpub lic
Ġcent ers
r Ã
Ġe cos
Ġ1 5
Ġdo cu
Ġ6 0
Ġaut onom
Ġes pecially
l ish
ĠI nd
Ġ1 1
Ġte chnologies
Ġbu ilt
Ġrecent ly
ĠSemiconduct or
rÃ ©
M D
Ġb ook
Ġdes ktop
ĠRyz en
rÃ© dit
Ġan aly
Ġtr a
Ġpo ss
Ġresp on
Ġen gine
orpor ate
Ġunder lying
Ġmac ro
F or
ĠA t
Ġe l
ow en
ĠM ay
Ġpl ace
ĠMar ch
Ġacc ount
itig roup
ĠEar nings
at t
Ġf ront
ent s
Ġpartic ip
con om
Ġs w
Ġcon clud
ĠK elly
Ġshi pping
Ġlist en
Ġecos ystem
n ed
at her
Ġc ame
Ġe conom
id er
ĠR uth
Ġnot ebook
Ġdri vers
Ġany thing
Ġnod e
k y
re et
ĠP icha
ĠG M
Ġint ern
av id
Ġdeliver ing
Ġstrateg ic
Ġautonom ous
ĠPicha i
2 4
e xt
m ost
ĠT AC
ir m
Ġ2 5
ĠF Y
ist ic
ĠKr amer
in c
ĠA r
Ġan t
ĠE n
ĠG oldman
Ġproduct ivity
Ġpre s
cent ric
no on
Ġcurrent ly
Ġam ount
Ġafter noon
Ġcoll abor
Ġ est
im er
Ġcall s
C I
le ment
Ġfor m
ĠO perating
Ġr ough
Ġstrong er
Ġrep resent
Ġstate ment
Ġfil ings
W ith
Ġs c
Ġde b
il ar
Ġen sure
Ġclear ly
Ġdocu ments
Ġant icip
r id
ĠA MD
Ġha nd
Ġinclud e
Ġacceler ate
Ġdeliver ed
Ġeff ort
Ġwee ks
ĠMe h
S und
l a
m end
in i
re m
Ġl ater
Ġ1 8
Ġhelp ing
Ġnum bers
Ġsequent ial
Sund ar
2 2
K elly
I t
t ics
Ġa ff
Ġd ays
ic t
Ġtr ack
Ġmult i
Ġmult ip
Ġhealth y
ex pect
4 0
G reat
l ow
Ġh ist
Ġhigh ly
Ġincre d
Ġch ain
Ġthough t
Ġprep ared
Ġf ind
Ġe as
Ġ1 3
Ġneed s
Ġacceler ated
Ġquick ly
Ġfr ame
Ġchallen g
Ġb re
Ġab s
ive ly
Ġus ed
ĠWh en
ĠCO VID
ĠCon ference
Ġ Z
Ġst ated
ol ette
fer red
Ġdecl ined
Ġbring ing
Ġhighl ight
r a
Ġd ynamics
Ġun i
Ġadd ress
ag ed
ĠCom m
Ġlead ership
Ġnetwor king
Ġtoward s
Ġrough ly
ĠB arclays
Ġat t
Ġcomp ar
Ġal most
Ġshare hold
Ġinclud es
Ġcount ries
s ide
Ġd ist
Ġexp ans
um m
ĠF X
Ġsu per
ĠComp ut
Ġpotent ial
Ġh ome
ĠO ther
Ġdig its
Ġhead wind
Ġbegin ning
C G
O S
Ġne g
Ġcomp on
Ġag ree
Ġdeb t
Ġmultip le
Ġth ree
or age
it ing
it ors
per formance
ac ing
Ġ1 00
uc a
G S
ĠM ichael
ĠCh uck
ĠSt reet
Ġgener al
Ġmean ing
Ġmodel s
Ġtim ing
Ġoper ations
Ġjoin ing
ar les
Ġad vanced
Ġv ir
Ġcap ability
Ġrep urch
Ġgreat er
Ġevery thing
Ġfeat ures
itz er
Ġmanufact uring
ĠS h
ot ive
arg o
Ġreason able
du ce
Ġtim es
ĠIS I
M E
l s
Ġin ference
Ġm ind
Ġquarter ly
op her
ull y
rist opher
o T
ar on
ĠD ynamics
ĠWe ll
Ġsim ilar
Ġadv ant
Ġanaly tics
a id
r n
pp ed
ĠP itzer
ink ed
Ġthrough out
Ġcombin ation
Ġbigg est
ĠHu ang
Ġemp loy
ĠInd ia
W ell
c ustom
s un
ĠI oT
ol f
ĠF argo
Ġac cess
Ġprocess or
Ġprof essional
Ġsw itch
r u
Ġwe lcome
Ġl oc
iz ing
Ġtrans act
Ġimpact ed
ĠAl though
Ġcre ate
PM organ
f ord
oo re
um ber
Ġthan ks
Ġrem inder
Ġsmart ph
ĠSw an
inked In
i an
p ri
Ġy et
ĠT V
Ġab ove
han n
Ġautom otive
Ġadj ust
3 3
3 4
W S
m ber
Ġs ince
Ġf ab
ct ion
ĠM oore
ĠH e
Ġme ans
ĠU n
Ġacceler ating
l ig
at ter
ĠA WS
Ġse mi
Ġres pect
Ġinv olve
Ġle verage
ĠDe utsche
Ġexperi enced
Ġbenef its
Ġf un
ro w
Ġg ame
Ġal ong
Ġdifferent i
ĠInvest ment
Ġfast er
Ġdef in
L et
ĠA D
Ġse ems
Ġcon vers
Ġst orage
ĠY over
ĠK e
Ġapplic ation
Ġsolut ion
Ġlarg er
Ġeng agement
Ġposs ible
ĠYover Y
2 6
R obert
an ford
and s
Ġapp s
Ġcomm it
A R
p art
v inder
Ġd r
ĠL inkedIn
Ġbec ome
ĠAm y
Ġbas ically
Ġsl ow
Ġintro duced
Ġexpans ion
2 7
or at
Ġbe h
Ġacceler ation
Ġem erg
Ġvari ety
Ġemploy e
3 5
f ic
Ġp ace
ĠC ook
ĠP orat
Ġ1 6
ĠH ard
Ġpl ans
Ġle ast
ĠCh ase
Ġ ess
Ġs ite
Ġ1 7
Ġstr uct
Ġsome wh
gan g
Ġann ual
Ch arles
olf gang
1 00
h i
ĠH ood
Ġcl ar
Ġramp ing
Ġconf irm
Ġreduct ion
g on
Ġf und
Ġpartn er
Ġimprove ments
Ġoffer ings
Ġstand point
Ġproject ions
ĠNe w
ĠQu arter
2 3
Ġc are
Ġon line
ive k
op y
yb rid
Ġrev iew
Tim othy
Ġa verage
ou nder
il i
Ġ6 4
Ġcomput e
Ġob lig
Ġpub lish
Ġlog ic
Ġabs olut
F ounder
as gon
ĠM use
ĠR asgon
ĠE vercore
Ġtr ain
Ġtr action
Ġsec ure
Ġlook s
Ġsa f
Ġexpand ed
Ġincreasing ly
Ġcomment ary
Ġext end
ĠAmeric a
Ġaff ect
2 8
Ġh olid
ĠS atya
Ġde al
AR Y
M S
d ed
s ky
ro tra
ĠO ls
Ġsh e
Ġres er
Ġpre d
av sky
Ġprocess ors
Ġris k
ĠMeh rotra
ĠOls avsky
Ġh ybrid
ĠC owen
ite ly
Ġman agement
Am y
ĠAct ual
Ġneg ative
Ġ 0
ĠP a
Ġhigh est
Ġcons ider
Ġreflect ing
Ġadvant age
3 2
Ġy ield
Ġn at
Ġro b
Ġreal ized
ob ile
Ġman age
Ġoblig ation
2 9
e ver
f ace
r ing
Ġc a
ur ance
ĠS I
ĠN O
em pl
ell a
Ġimpro ved
Ġmon et
Ġequ ipment
ĠSSD s
Ġess ent
it ical
ĠC rÃ©dit
ust ain
ĠO ver
ific ation
Ġprovid ers
Ġremain s
Ġeffici ency
Ġvir t
3 1
3 6
D e
R uth
T X
X T
Ġt end
Ġw ays
Ġs ustain
Ġm aterially
ĠO N
ĠF orm
Ġact ive
Ġro ll
ĠEqu ipment
Ġadvertis ers
St acy
Ġdefin itely
S anjay
f A
ĠD ata
Ġst ock
ĠG ener
Ġout put
Ġmarket ing
Ġapp reci
Ġindic ate
ĠBo fA
u ally
ĠA aron
ĠS earch
ad ella
ĠG e
ĠN adella
ter prise
ĠJ PMorgan
ident ified
av or
Ġactu al
Ġrespon se
3 8
C on
h aps
o ice
id es
Ġst ack
Ġac cur
ie f
ĠCh ief
ens en
Ġexperi ences
Ġnetwor ks
yp ers
Ġexpand ing
mi um
re am
le m
ĠL isa
Ġfin al
Ġprovid ing
Ġlarge ly
IS S
ĠOffic er
Ġsharehold ers
Ġemerg ing
f or
n er
ro id
Ġl ic
ĠC ross
ĠD CG
ĠP LC
Ġcall ed
Ġadd ed
od y
Ġwa fer
Ġfair ly
part y
E W
E RS
S ENT
p ro
Ġc r
Ġ2 4
VI EW
Ġgam es
rel ated
Ġrecogn ition
arl an
PRE SENT
Ġbre ak
empl ated
PRESENT ATION
4 5
I T
T urning
a ke
Ġre ad
Ġl at
Ġper haps
Ġfull y
Ġdou b
Ġbigg er
Ġintellig ence
Ġcollabor ation
Ġest im
rn ie
S atya
Ġ ve
Ġp aid
Ġd is
Ġre ce
ĠC itigroup
ĠR BC
ĠAnd roid
Ġde ferred
Ġta kes
Ġar t
Ġdiscuss ed
Ġmajor ity
Ġpres ent
M A
d ri
ĠW ill
Ġtrans formation
ĠSt r
Ġannoun ce
Ġholid ay
Ġh ypers
Ġen han
Ġen able
Ġbu y
ater ial
Ġrun ning
Ġpurch ase
ĠHard ware
Ġreser ves
6 0
S I
b ox
r ight
w ay
er ved
st ate
id ence
Ġex ist
Ġde vice
ot al
Ġshare s
Ġinclud ed
Ġagain st
Ġrelative ly
Ġweb cast
Ġstore s
Ġupgr ade
T A
c an
w ide
Ġt est
Ġs umm
ent lem
Ġg entlem
Ġpro ve
Ġex clud
ĠE R
Ġpart ially
Ġpre vious
Ġtrans form
ef in
Th at
Ġprovid er
Ġgentlem en
h ic
r ain
w or
Ġ /
Ġf lex
Ġqu ant
ay m
Ġpro t
Ġex tra
ect or
Ġrep l
Ġcomput er
Ġass urance
Ġprovid ed
ib ly
Ġdist ribut
A M
Ġf avor
om ura
Ġn ice
ĠM r
Ġex act
ad ies
ast ic
Ġgo es
Ġchang ed
Ġposition ed
Ġt ri
ĠA C
Ġg ives
th ers
ĠM obile
ĠE u
il ut
Ġj ob
Ġpre mium
ĠSt ore
itt ed
os hi
Ġshe et
Q u
b ody
Ġ vert
in formation
Ġm il
Ġd ro
ĠS uch
ĠD O
ĠRes erved
Ġgo al
Ġrec on
cur i
Ġwho le
Ġado pt
Ġgeograph ic
ĠAr curi
Ġemploye es
C ON
C orporate
D isc
E L
E RI
E vent
H sun
S U
f ill
i ants
u ation
at ic
ith er
ĠO M
ĠB A
Ġus age
Ġ3 4
Ġnot ify
ist ant
Th is
Ġi OS
ĠIT S
ĠParticip ants
ĠParticip iants
Ġmet ric
ĠGM T
ĠComput ing
ĠStreet Event
opy right
Con ference
Ġaccur ately
ERI AL
ĠStreetEvent s
3 7
A Y
B ILI
C opyright
D ECISIONS
E B
E XT
F FOR
H I
K ING
N GS
O F
P OR
P ROVID
R OR
T S
T Y
T AN
T ING
U AL
e y
m aterially
n umber
s uch
or a
Ġin accurate
ĠS UBS
ĠT EXT
ĠM AT
ĠD ECISIONS
ĠR ES
ĠR ights
ĠR TX
ĠW AY
ĠW EB
ĠW HI
ĠE FFOR
ĠP ROVID
Ġcont r
ĠF OR
ĠF ILI
FO RE
ĠU PON
ĠSt acy
VI SED
ĠAS SU
ĠTHE RE
ĠIN AC
ne w
IN ED
ĠTRANSCRIPT S
ĠTRANSCRIPT ION
ĠTranscript s
Ġhapp y
ĠRE VIEW
ĠRE PRESENTATION
ĠRE POR
ĠUS ERS
ĠCON TA
ĠMA Y
ĠCALL S
ĠTH IS
ĠBE FORE
PON SI
CURA TE
CURA CI
cont emplated
Ġbook ings
inc orrect
la imer
expect ations
ĠAD VISED
ĠSI TE
ISS IONS
MA KING
state ments
ĠER ROR
ĠAC CURATE
ĠDO ES
CON FERENCE
Disc laimer
EL F
ĠOM ISSIONS
ĠBA SED
ĠITS ELF
BILI TY
PROVID E
TAN CE
ĠSUBS TANCE
ĠTEXT UAL
ĠMAT ERIAL
ĠRES PONSI
ĠWHI LE
ĠEFFOR TS
ĠPROVID ED
ĠFILI NGS
ĠASSU ME
ĠINAC CURACI
ĠREPOR TING
ĠCONTA INED
ĠERROR S
ĠRESPONSI BILITY
ĠINACCURACI ES
h en
m ar
o ard
at s
Ġs ize
Ġm aterial
ĠT AM
ad d
ĠTh omson
Ġma kes
Ġexecut e
Ġdiscuss ion
ĠX box
bed ded
Ġtranscri bed
ĠGener al
O MS
U TE
e e
Ġ ver
Ġc ase
Ġre d
Ġl ive
Ġe ither
ĠD ay
ĠP lease
Ġcont ext
Ġbec om
ag er
Ġfollow ing
ĠRE UTE
Ġdetail s
ĠTH OMS
Ġvis ibility
Ġeffort s
Ġvert ical
Ġdro ve
ĠREUTE RS
ĠTHOMS ON
re p
Ġw in
Ġf ac
Ġm ap
Ġst ay
ĠP lay
ĠB ob
fer ies
Ġen c
Ġser vers
ef feries
Ġrel ations
Ġdisc on
ĠSec ond
Ġweak ness
ĠEn terprise
ĠWell s
c es
f ully
z an
ĠM o
Ġ2 1
Ġcont ro
Ġpart s
Ġadd ing
Ġ4 5
Ġgener ated
ĠKr zan
Ġgain s
Ġiss ues
Ġdiscon nect
ĠKrzan ich
Y our
it or
Ġf am
Ġp at
ĠC enter
Ġbe low
Ġse lf
im on
ul fill
ĠN V
Ġpre viously
ens ive
cript ions
Ġimpro ving
Ġincreas es
Ġconf ident
Ġreport ed
Ġhappen ing
Ġupgr ad
Ġcontr act
v al
ĠA ry
Ġl oss
Ġha ven
Ġ2 2
Ġ2 6
ac es
ĠL et
Ġdif fic
Ġend ed
Ġport ion
Ġpri v
Ġsubs criptions
Ġnear ly
ĠSe pt
Ġdollar s
iss ion
Ġseasonal ity
Ġcateg ories
Qu estion
ĠAry a
en ing
ou g
Ġm ed
Ġg r
th rough
ĠM ora
Ġpo p
Ġrep lay
Ġavail ability
Ġplan ning
enc ies
Ġpublish ed
Ġtrain ing
Ġrecon c
b at
d own
Ġp hone
us ic
ĠT re
se lf
ens ity
Ġoffer ing
Ġsit es
Ġappreci ate
pro f
3 9
D efin
E d
M e
T o
a king
m s
o e
Ġw ins
ĠP l
ot t
Ġr out
Ġrem ind
Ġcomm itted
Ġdec re
Ġmin us
. .
k en
r ation
an i
Ġf ulfill
Ġd ilut
ch ange
ac ks
Ġ20 0
Ġtr y
Ġincre mental
Ġtrans cription
Ġ9 0
Ġvar ious
ĠSur face
rop e
Ġlisten ed
Ġve hic
ĠEu rope
rep resent
M ic
P resent
a S
Ġo thers
it ut
ĠA R
Ġas so
lo g
ĠAn sw
Ġtr ade
Ġpo st
Ġcompet ition
ĠMan ager
Ġed ited
Ġnod es
Ġinit ial
Ġuni que
Present ation
Ġasso ci
C P
M IN
P reliminary
T ranscript
u g
ed itors
ĠD o
ĠP reliminary
Ġ1 9
Ġad s
LI MIN
ED IT
Ġtre mend
Ġconf idence
PRE LIMIN
Ġinit i
cont ent
Ġlay ers
Ġtranscri ber
Ġmeaning ful
Ġvirt ual
Ġver bat
Question s
prof essional
Defin itions
Ed ited
represent s
ĠAnsw ers
EDIT ED
Ġtremend ous
PRELIMIN ARY
Ġverbat im
J ust
b viously
at ors
or ry
Ġp ull
ur can
ĠI P
ĠS anford
ĠD urcan
Ġ2 8
ĠH ar
ĠY es
ĠY our
Ġreflect s
Ġsuccess ful
Ġcar s
ĠAss istant
Ġchalleng es
Ġrelations hip
4 2
M O
y e
Ġ =
ĠC ur
ĠM add
ab les
Ġexpect ing
Ġte chn
Ġcons olid
Ġindust ries
lay ne
Ġship ment
enc ing
Ġclos ing
Ġmonet ization
Ġexist ing
Ġassoci ated
ĠMadd ock
u ity
ĠS p
Ġlike ly
Ġcre ated
Ġdoes n
Ġunderstand ing
Ġexce ed
Ġachie ve
m on
in ally
Ġw atch
at or
ĠS ector
le v
ĠR oss
ot e
ĠB ets
ĠN etwor
res h
Ġplan ned
Ġwond er
Ġpartnership s
Ġcompon ent
Ġlat est
. '
4 1
J ohn
e g
Ġt urning
Ġc or
Ġl ines
ĠS m
Ġse ct
se l
Ġconst rain
Ġassum e
erg y
Ġcombin ed
Ġsit uation
Ġpred ict
Ġexact ly
L P
M organ
i am
p ite
ĠA c
ĠM ember
Ġcont ain
ĠH igh
so le
Ġun t
Ġdem on
ĠSt e
red it
Ġeffect ive
B ut
Ġg ave
ĠP ay
ap an
um p
ĠL uca
Ġ3 1
ĠJ apan
Ġrecord ed
Ġmeas ure
Ġincred ibly
Ġabsolut ely
Ġprot ect
b ack
Ġp ie
Ġl if
ver n
ce mber
Ġcon sole
Ġgo vern
rou d
Ġreason s
Ġtyp e
Ġreach ed
Ġdiffic ult
4 6
D avid
Ġc ases
ĠA re
as ur
Ġpro ble
our ce
Ġbu yb
Ġact ivity
iv ed
Ġopen ing
Ġsell ing
Ġconclud e
Ġsc en
Ġsomewh at
Ġfund a
Ġhypers cale
Ġmetric s
Ġunt il
V P
r al
re t
Ġf all
Ġp roud
Ġd ate
ĠC olette
ĠS VP
th e
ĠO bviously
Ġim m
ĠJ an
ĠDe cember
Ġbr and
pl ace
Ġprogram m
Ġexc iting
Ġel se
Ġswitch ing
Ġcommit ment
ĠTre asur
Ġdemon st
m ore
u ge
w ise
Ġc orrect
Ġg ig
Ġl ight
ĠW atch
ĠB usiness
ul ations
Ġtr ad
ĠJ u
Ġout side
Ġrel ates
Ġrecord s
ne y
Ġdid n
Ġuncertain ty
Ġclose ly
Ġintegr ated
Ġiss ue
Ġtra ject
Ġhist or
ĠWill iam
Ġmil est
Ġenc our
5 5
a h
o ving
p ort
Ġcon c
stand ing
Ġbroad er
Ġengine ering
Ġanticip ate
Ġcr itical
Ġpie ce
t en
Ġc amp
ĠS anjay
ĠM emory
Ġ2 7
Ġcomp are
um ar
Ġall oc
Ġ201 5
oun ts
ĠK umar
Ġdeli very
Ġcre ating
Ġintro duct
Ġachie ved
Ġcateg ory
4 3
G X
J en
f ers
i ving
in t
Ġth reat
ar io
Ġl ed
ĠM ore
ĠD es
ab y
el ine
Ġor ig
ĠCh ristopher
Ġhelp s
Ġdisc lo
Ġworld wide
lob ally
Ġdep end
Ġacquis itions
Ġrequire ments
Ġenab ling
mar ket
N A
p rem
Ġ ut
Ġh it
Ġre new
ĠT oshi
ĠB a
Ġexpect ation
ens or
Ġbu ying
Ġprior ities
ĠPC s
Ġcy cl
Ġstand ard
Ġlay er
Ġsub st
Ġessent ially
Ġtraject ory
d i
Ġre duced
Ġl im
ĠS and
ĠD avid
Ġr ap
Ġcomp ens
Ġcomp lex
Ġ3 2
ĠV ivek
ĠK ress
olut ion
lay er
Ġspe ak
Ġcommun ity
Ġeconom ic
Ġreconc ili
Ġscen ario
Ġdemonst r
Ġrap id
g ain
l ined
t is
Ġb ott
ĠA pri
Ġg lobally
ĠT otal
Ġr ay
ĠN omura
ĠH P
Ġrem ember
Ġfact or
Ġoff ers
Ġro le
Ġreg ions
ĠX e
Ġconnect ed
For ce
Ġsmartph one
dri ving
Ġpop ular
ĠCur tis
ĠApri l
an e
ĠR ak
ĠW est
ĠP ost
ĠAn y
Ġall ow
our ces
Ġta ken
ĠMar ily
lect ion
Ġthough ts
Ġoper ational
Ġpower ful
Ġwa fers
Ġreduct ions
Ġframe wor
ĠStr ateg
ĠXe on
ĠMarily n
u ary
Ġw ent
ĠS P
Ġcon d
Ġr a
ĠG ood
Ġv oice
Ġper form
ition al
Ġun less
ose ph
Ġfe ed
Ġfin ally
ĠTe ams
Ġsay ing
Ch ris
Ġask ed
Ġautom ation
Ġfun ction
Ġrece ived
Ġflex ibility
Ġrout ing
sel ves
c k
c ount
o pping
Ġ et
Ġt ough
Ġd ynam
Ġl ith
ĠT uring
ĠP h
Ġen ergy
Ġta il
Ġtrans itions
ep hen
ĠDe vinder
ĠSec urity
Ġexecut ing
Ġprogram s
Ġintellig ent
Ġaccount ing
Ġdr am
Ġlic ens
Ġfavor able
Ġconsolid ated
ĠJan uary
Ġconc ern
ĠStrateg ist
4 4
a aS
Ġh uge
Ġac com
Ġguid ed
Ġmod em
Ġgener ally
tr act
Ġext rem
ĠOEM s
Ġcommun ic
hann on
o v
Ġ ide
Ġp us
Ġp ol
Ġne cess
Ġint ent
ĠL aw
ĠJ efferies
ĠV R
ĠV ol
Ġch ip
Ġconsum ption
ĠEV P
Ġeffici ent
Ġshi pped
ĠTo day
Ġintern ational
ĠTreasur er
B of
i jay
l as
v a
Ġw r
Ġs cal
Ġf ive
Ġf ield
Ġp ip
Ġg iving
Ġit self
Ġ2 3
em bers
og er
Ġ3 5
ific ial
Ġgam ers
uc ing
Ġpotent ially
Ġorgan ization
Bof A
D R
G ood
o y
p os
er a
Ġs ess
is on
Ġl ove
Ġst ream
ĠW olfgang
ĠE very
ĠB ell
ĠH ome
Ġtr acing
Ġres earch
Ġnot ed
ĠJ P
Ġwould n
ry pt
Ġdep reci
Ġconsum ers
ĠAmeric as
Ġhop ing
Ġcompar ison
ĠHe ather
Ġca ut
oug las
Ġdynam ic
M oving
er y
at is
Ġm ig
ĠR ade
oo t
Ġtr ue
oc i
Ġinvest ors
Ġmillion s
Ġsecond ly
Ġother wise
ag u
Ġchang ing
Ġsl ides
Ġequ ity
Ġfore ign
Ġspe ed
Ġtoo k
Ġhist ory
Ġhighlight ed
Ġstruct ure
Ġart ificial
Ġrepl ace
Ġlicens ing
Ġextrem ely
ĠBell ini
ĠRade on
5 3
ur ring
ĠC redit
il ization
ĠH os
Ġdec ision
Ġmeet ing
ĠAss oci
Ġconclud es
Ġtransact ional
Ġupgrad es
Ġfulfill ment
ĠBa ird
4 8
4 9
M arily
a ura
f ort
on al
re g
re w
en ning
it er
est ri
Ġde als
ĠB r
ĠH enning
ec ause
Ġ3 3
Ġ3 8
ren t
oth ing
ĠDe ep
Ġfollow ed
Ġreal ity
Ġprim ary
Ġvol at
Ġtyp ically
ĠMa estri
Ġdifferenti ated
imon a
Marily n
ĠHenning er
C olette
S ec
y per
at ives
or th
Ġf ix
ch o
se ini
Ġne ver
il icon
Ġso on
Ġsec ular
Ġpric es
Ġ7 0
Ġdevelo per
Ġdecl ines
Ġbroad ly
Ġintro duce
ier re
Ġdividend s
Ġincred ible
Ġfab s
ĠGe Force
Ġfam ily
ĠHos seini
5 2
P oint
d le
h e
ĠC ustom
ĠC ore
ĠD an
ri ef
Ġat tract
Ġget s
Ġdif ference
ef ore
Ġprior ity
Ġprovid es
Ġmonth ly
Ġref resh
Ġindic ated
Ġpress ure
Ġfast est
Ġhear d
Ġreturn ed
wh ere
ĠMay be
Ġeas ier
Ġpat tern
ĠSept ember
Ġpip eline
4 7
G oldman
d e
Ġs orry
Ġc ause
Ġd at
ĠA lex
ĠC orp
ĠS ome
Ġrec urring
ĠCh ris
ĠPro duct
ĠHow ever
ĠComm ercial
Ġagree ment
Ġrepurch ases
Ġloc al
Ġenhan ce
Ġtechn ical
Ġgovern ment
Ġcompens ation
Ġcond itions
F irst
a ff
i ke
Ġb oard
Ġh our
et ers
Ġbe gan
ĠM y
ĠR ome
Ġu l
ĠB ecause
Ġcont act
Ġv ision
Ġte le
ist ics
orpor ated
ris h
Ġann uity
Ġlaunch es
Ġph ones
Ġadv ance
ĠCPU s
Ġexclud ing
Ġdilut ed
Ġsect or
F inally
G ot
s ingle
t d
Ġc ross
Ġc eter
th an
Ġpro m
ĠR obert
ĠN ick
Ġal though
Ġtr ust
ĠL og
ĠL td
iz ations
Ġun p
Ġag gress
Ġmod est
pris es
pect s
ĠAl an
Ġprof ile
Ġhe av
Ch uck
Ġdesign ed
ĠNow ak
Ġheadwind s
Ġagree ments
Ġbeh ind
Ġsaf e
Ġnat ural
Ġlif e
Ġpol ic
Ġceter a
ĠNick l
5 8
a us
o ff
r ay
om mend
Ġn othing
us que
Ġon ce
ol es
if el
ĠP as
Ġexp end
ĠH arlan
Ġimp lement
Ġle g
Ġser ve
Ġact ions
ĠSu ite
und red
Ġdeploy ment
Ġdirect ly
hann a
val ue
Ġsubst ant
Ġbott om
usque hanna
5 4
5 7
A S
D uring
e i
m uth
y more
Ġa ud
er v
Ġf oot
ĠT ensor
Ġas king
ĠD ave
ri al
ĠB MO
ap e
ĠAn muth
ĠJ oe
Ġout standing
Ġdisc ip
Ch ristopher
Ġcoll ect
ĠSe ymore
Ġintegr ation
Ġcycl es
Ġexpend it
B arclays
v in
er ce
Ġo c
Ġo ptions
Ġh undred
ĠS her
ĠM usic
id an
Ġal ign
ĠL ast
Ġmarket place
Ġrec ommend
anc y
Ġch oo
ĠInt ellig
ang u
Ġext ent
Ġdi vers
ograph y
Ġenab les
Ġcomplet e
Ġparticip ating
Ġcontract s
ĠNetwor king
ĠSm ith
ĠSher idan
A t
R oss
re h
at ically
Ġs iz
Ġs ound
Ġp e
Ġm embers
ll en
ĠS i
Ġse em
ĠR ams
Ġ2 9
Ġcomp reh
ĠU V
Ġindust rial
Ġimportant ly
Ġman aging
Ġdevelop ing
Ġtyp es
Ġsub ject
ĠTim othy
Ġnotebook s
Ġsmartph ones
Ġbecom ing
Ġvehic les
Ġtrad itional
Ġalloc ation
ĠRams ay
L uca
N ext
S G
Ġs atis
or ge
ĠA gain
Ġl angu
ĠE m
ĠF rom
han ey
ĠL ip
Ġpl aces
Ġnew s
ific ations
Ġresul ting
Ġdes pite
Ġem bedded
Ġdiscuss ions
Ġreflect ed
ĠSer ver
ĠInst itut
ĠMa haney
Ġoptim istic
Ġyield s
Ġdoub led
Ġcontro l
Ġintroduct ion
Ġsatis f
U V
ce pt
ĠR ed
ĠW ear
ol ving
ĠF eb
Ġall ows
Ġcan n
ĠJ ensen
ĠCorpor ate
Ġmod er
Ġevent s
Ġ34 00
Ġfeed back
Ġreplace ment
Ġexpendit ures
E rnie
W olfgang
b r
v iew
Ġo perator
at y
al e
ent ed
ĠM il
Ġpro per
Ġcom fort
ĠTh ose
ac is
ĠF P
Ġtrans l
Ġcons oles
Ġimpact ing
Ġlot s
ire d
ire less
ĠEqu ities
Ġdig it
pl us
Ġprofit able
Ġhappen ed
Ġsell ers
Ġcompon ents
Ġrob ot
ĠOver all
aym ond
ĠMobile ye
ĠSte ves
Ġra is
Sec ond
ĠLip acis
5 9
g row
er t
Ġs old
Ġp ath
ĠA ir
Ġh ost
Ġre in
as ing
ĠC ould
ce ed
Ġex change
ĠW ong
ĠO perator
Ġ20 21
Ġsec urities
Ġass ess
Ġsupp li
Ġprocess ing
Ġaut h
Ġtarg ets
Ġcontribut ion
Ġmain tain
Ġanticip ated
Ġchalleng ing
Ġsuper com
Ġrob ust
De vinder
ĠInstitut ional
5 1
7 0
h ones
Ġb rief
om it
ch ed
ĠM os
ĠD GX
ĠW or
ĠE ric
ĠTh ird
ĠG ross
ĠN et
ĠInc orporated
Ġco ver
Ġmod ern
ĠiP hones
Ġmon itor
Ġ8 0
Ġput s
Ġcar ry
ĠFin ance
ĠSemiconduct ors
Ġorig in
ĠPas cal
ĠFP G
5 6
J ensen
c ing
i ec
Ġs ilicon
Ġc rypt
Ġp ick
Ġre nder
Ġre duce
Ġn anometer
ĠP ower
Ġr ich
ul ts
ĠG D
ook ing
Ġen ough
ous ands
anc es
cl ass
Ġshare d
ĠSu h
Ġback log
Ġeng age
Ġcompar able
Ġframewor k
ĠVol ta
Ġul t
Ġsuppli ers
A d
C itigroup
in ing
Ġs ource
it ative
Ġm ass
Ġre lev
ol in
Ġan alyst
ĠB layne
ul ation
em and
Ġ5 00
Ġrem ote
Ġguid ing
Ġro om
iven ess
Ġenviron ments
Ġexecut ed
Ġarchitect ural
Ġeffici encies
Ġrecogn ize
Ġestim ate
Ġiniti atives
Ġdepreci ation
Ġfix ed
ĠIntellig ent
B efore
i res
o very
Ġa way
en he
Ġc orporate
ou se
Ġf ant
Ġp ur
Ġg roup
ĠT a
Ġcon gr
ĠW al
pp enhe
Ġde celer
ir ing
ĠE rnie
Ġsh ar
and e
ĠF err
lo ck
Ġstart s
Ġfact ory
Ġenter prises
Ġman aged
Ġreg ion
Ġins ights
ĠHu aw
Ġweak er
Ġchallen ge
Ġexce ll
Ġstep s
ĠSh ah
Mic ron
Ġrelationship s
Ġreconcili ation
Ġpus h
Ġsess ion
ĠLog ic
Ġfant astic
ppenhe imer
ĠFerr agu
ĠHuaw ei
J P
Q L
g g
h m
re te
at ulations
en ed
Ġc le
Ġp ass
Ġm at
Ġm ic
om as
ĠM aps
ĠP ix
ĠRes ults
un g
Ġsu gg
Ġ3 7
Ġnot e
Ġcl ass
ition ally
ren ce
cl us
ĠSt ephen
iv al
Ġch ar
Ġmost ly
Ġhapp ens
Ġph ot
Ġinterest ing
Ġins ide
Ġmin ut
Ġorgan izations
Ġhop e
for ce
Ġread y
ĠHar i
ĠLaw rence
Ġoc cur
6 1
A ll
F rom
p ower
s cale
Ġ ident
Ġw al
Ġs amp
an a
is ions
Ġp iec
ed ge
ĠS aaS
if f
Ġj our
act er
ĠV ice
Ġbit s
ank ly
Ġsupport ing
ĠX Point
Ġqual ity
Ġgeograph ies
ta i
Ġrepresent s
expect ed
Ġrepurch ase
ru ary
Ġfac ilities
Ġprogramm atic
ĠRak ers
Ġvolat ility
Ġheav ily
Ġpolic y
Ġchar acter
Ġpiec es
8 0
B A
D A
L adies
i um
k i
Ġt ab
Ġt ight
en e
Ġc ities
ar iff
Ġse m
se c
il ot
Ġsh opping
ĠN ove
ĠN orth
ĠF r
ĠL ake
Ġdri ves
ĠU p
Ġwork ed
Ġaut o
Ġresult ed
Ġsmall er
Ġrespon s
Ġeconom y
Ġpresent ation
ĠDan ely
Ġsatisf action
ĠWear ables
Ġauth or
ĠNove mber
W h
Y ou
g reg
n ers
Ġth ousands
en et
Ġs ci
Ġp ack
Ġm atter
Ġd om
ic ol
ĠS QL
le ments
Ġon es
Ġst ud
ĠO f
ĠG CP
ĠN A
ap top
Ġmarket able
Ġen j
Ġtrans action
Ġhelp ed
itt ing
lic ations
av es
Ġdes cri
Ġequ ival
Ġfil ed
Ġroad m
Ġrequire d
att ers
ĠNV Me
Ġtail wind
C rÃ©dit
H arlan
L LP
V E
e ff
u ff
Ġt ariff
Ġp ar
Ġm atters
ĠTh en
ĠTh omas
ĠN icol
ĠL LLP
ĠJ ank
ĠY ear
Ġneed ed
Ġgener ate
ows ki
Ġam az
Ġsubs cri
Ġsim ple
Ġph ys
Ġdeploy ments
Ġfeat ure
Ġclos er
Ġaffect ed
Ġsumm ary
Ġlim ited
Ġlangu age
ĠFeb ruary
Ġcle an
Ġsugg est
ĠNicol aus
ĠJank owski
V ivek
i per
s u
Ġw on
Ġc ard
Ġp ause
Ġm ath
Ġg one
ĠC at
id y
Ġst uff
ad ing
ĠE d
Ġsh ows
are n
un ov
xt on
Ġag greg
ef ul
Ġob ject
Ġcre ators
Ġdet ect
Ġfr ankly
Ġpurch ases
Ġclos ed
Ġadj ac
Ġtransact ions
Ġclar ification
ĠPa xton
De utsche
aym o
Ġproble m
Ġbuyb ack
ĠMil unov
Ġwal k
ĠMilunov ich
6 2
7 4
A l
Ġc ut
Ġb ill
Ġm aps
ĠS eb
Ġour selves
ĠT er
Ġcon vert
ĠW aymo
ĠO pt
em ic
ast ian
fer encing
ĠF BA
Ġres ources
Ġimpact s
os ed
Ġappro pri
com ing
Ġdevelop ed
Ġinvent ories
Ġmach ines
Ġput ting
Ġacc ounts
Ġpower ed
Ġrecogn ized
Ġfound ation
Ġcomplet ed
inc ip
Ġbreak through
Ġexceed ed
Ġgig aby
Ġide a
Ġscal ing
Ġcompreh ensive
Ġorigin al
Ġult imately
ĠPix el
ĠSeb astian
H ub
R BC
a ign
at han
Ġs ched
ar han
it Hub
is ts
Ġp enet
ĠS E
ĠS G
ĠS usquehanna
ĠR oger
Ġne ural
Ġgrow n
ĠG itHub
Ġwor ks
ber ty
Ġinvest ed
be am
Ġcap t
ĠSt ifel
Ġdisc rete
Ġla w
Ġed uc
Ġreport s
Ġsim p
Ġvolum es
Ġpay ments
ĠMa x
Ġlog istics
Ġtra ffic
Ġeas y
Ġdis p
Ġpriv ate
Ġpriv acy
.. .
Ġscenario s
ĠHP C
Ġcomparison s
Ġamaz ing
5 00
E vercore
l and
p e
Ġ ven
Ġt er
en om
Ġs ale
Ġf ue
ĠA ug
Ġg ate
Ġh is
ĠC lient
ut ive
ĠT LC
ĠM ur
ĠM att
Ġst able
ĠR a
if ying
ĠIn f
ĠG raphics
ĠL e
Ġrec overy
ric t
Ġass ets
ĠAd d
Ġcompet itors
Ġremain ing
Ġdec ade
Ġcount ry
Ġhead count
Ġmid dle
ĠPart ners
Ġins pect
Ġproject s
Ġspe aking
Ġfound ry
Ġperson al
Ġengine ers
ĠZ en
Ġsaf ety
Ġnat ure
Ġannounce ment
Ġextra ord
Ġnice ly
ĠPl us
Ġrapid ly
Ġdram atically
Ġmig r
sec utive
6 9
C s
k ip
Ġw ireless
ĠA hm
ic es
ĠC ash
ear ned
ĠS D
ĠS K
ĠD UV
Ġcon secutive
Ġr ather
Ġup side
ĠF Q
ĠF iscal
Ġle ver
Ġun earned
ĠSu va
Ġevery body
Ġlaunch ing
Ġbr ings
Ġinnov ative
Ġdeploy ed
ĠHu berty
Ġresp ond
ĠSw itch
ins ner
ĠZ insner
Ġsomewh ere
Ġdistribut ed
pos ition
Ġdat ab
ĠAlex a
Ġsound s
Ġven d
N o
b rish
u ed
Ġt ou
at the
Ġd ial
Ġd ensity
Ġl ate
ĠR et
ri v
ĠO ct
Ġr ang
ĠG r
Ġsh if
Ġal one
are h
Ġv ast
ĠJ aff
anc ing
Ġind ivid
Ġwork ers
cal able
Ġinnov ate
Ġrest ruct
Ġnormal ized
Ġadjust ments
Ġdoub ling
Ġred ucing
Ġdecre ase
Ġfunda mental
Ġut ilization
Ġhundred s
Ġcomfort able
ĠInf rastructure
atthe w
2 00
8 6
C owen
H i
K e
e ch
f ect
g ing
s ing
Ġs yn
ic ations
Ġl aptop
ĠS hannon
ĠS calable
le ading
qu al
ĠD uring
Ġst age
el t
ac ific
Ġup coming
Ġint ensity
ec onom
Ġ4 1
ef ully
Ġ6 5
av a
Ġdecl ining
AT A
Ġinterest ed
ĠCon s
Ġev olve
Ġshort ages
Ġsur pris
Ġshow ing
Ġparticip ation
ĠUn ited
Ġcommit ments
Ġannounce ments
Ġquant ify
ĠPl atform
ĠJu ly
Ġmilest one
Ġexcell ent
Ġaggreg ate
athan son
ĠJaff ray
A pp
i k
u le
Ġw rap
Ġs ens
Ġb l
ĠA AP
Ġre li
ch ang
ers onal
ul es
Ġcomp li
um e
un ications
ĠJ im
ight ed
ud ible
one y
ĠCh rom
Ġcur ve
Ġthrough put
Ġrep e
Ġline up
In t
anom eters
ĠCO GS
Ġlear n
Ġassum ing
Ġinter act
Ġarchitect ures
Ġdec isions
Ġeffect ively
pec ific
led ge
Am it
Ġ60 6
Ġrepresent ed
Ġatt ach
Ġfun ct
Ġmed ium
Ġpost ed
Ġstream ing
Ġcaut ious
Ġdiscip lined
Ġsupercom put
ĠAug ust
ĠSK U
ĠOct ober
ĠAAP L
H e
O perating
S anford
e per
g or
i ence
Ġw areh
Ġs ix
it ud
an ox
al mon
is es
ro soft
ĠA CI
Ġh yper
ĠC as
ĠS almon
ch and
ut y
us i
ĠT al
ĠM ell
Ġde l
Ġde eper
ĠP ersonal
ĠWe b
Ġmar k
ard in
Ġal gor
ĠJ oseph
ud g
Ġtrans port
Ġsign als
Ġ6 3
Ġimport ance
Ġreal ize
Ġprior it
Ġconst ruct
ina udible
ĠSer vice
Ġreport ing
Ġph ase
Ġoper ate
Ġplay ing
Ġeng aged
ĠJust in
Ġoptim ize
Ġmacro econom
ĠKe ith
Ġsustain able
Ġtest ing
Ġvertical s
To day
Ġrelev ant
Ġminut es
Ġjour ney
Ġinspect ion
Int el
ĠMell anox
Ġalgor ith
h o
h di
w er
Ġw ide
Ġc ris
Ġf lo
Ġp and
ed i
ĠC ass
ĠS imona
Ġse ction
ĠB y
ĠG ardin
ĠF ort
Ġv ia
ans wer
li ke
Ġres pective
ĠJ V
ĠK id
Ġkind s
Ġ7 5
ĠAs ia
Ġlead er
Ġstrength ening
Ġinnov ations
Ġam ong
te ens
ines e
Ġdeploy ing
Ġev al
Ġcomplet ely
Ġmulti year
ĠComm unications
Ġconvers ations
Ġessent ial
Me hdi
Ġcamp aign
ĠEm bedded
Ġmass ive
Ġequival ents
ĠAhm ad
Ġpand emic
ĠCass idy
ĠGardin er
6 4
b re
c ket
p ar
Ġc ad
ar in
Ġb lock
Ġm ess
Ġm oney
Ġl adies
ĠS riv
ill er
Ġpro ceed
ĠR aymond
ĠE ven
ĠE llen
ĠP ierre
ab lish
Ġexp l
ast ava
ĠF und
Ġbillion s
Ġtrans cript
Ġwork st
Ġfocus ing
Ġcomput ational
com m
Ġreg ul
Ġpay ment
Well s
Ġbecom es
Ġfunda ment
ĠAssoci ates
Ġcrypt o
ĠOpt ane
ĠGr aves
itud e
Ġcad ence
ĠSriv astava
6 3
P od
T C
a gine
Ġt it
in vest
Ġo ld
Ġb ox
ic o
Ġh old
ĠS il
Ġn ame
im es
ĠD ass
ĠTh ill
ĠG re
Ġus eful
ong r
li ed
Ġwor d
Ġwor th
ĠCh inese
Ġinvest or
Ġco de
Ġcomm s
Ġcomm on
ĠAm it
av ior
ph one
Ġramp s
Ġset t
Ġph enom
Ġev olving
Ġbeh avior
Ġabsolut e
Ġsumm ar
Ġdecre ased
Mic rosoft
mon th
Ġimm ers
Ġhistor ical
Ġmilest ones
ĠToshi ya
ĠSand ler
Ġsubstant ial
Ġextraord inary
Ġmacroeconom ic
Ġcris is
ĠSil ver
Ġphenom en
6 7
C isco
h am
h usi
i vers
p r
at ory
Ġf ill
Ġm atch
ed ham
ur ally
Ġre leased
ĠS ams
le vel
Ġse par
Ġmo ved
ĠE ast
ĠP acific
ac king
ĠH ol
orm ous
end ed
Ġimp ress
Ġma g
Ġpl ays
Ġen ormous
Ġstrong est
rough t
Ġact ion
av ath
oll and
Ġcompet itor
Ġacc ret
Ġqual ifications
Ġpay ing
Ġdirect ion
Ġslow down
Ġclar ify
Ġcamp us
Ġdisclo sure
Ġtransport ation
ĠSilver stein
ĠSams ung
N ancy
V ijay
f ield
l it
er ies
Ġb read
Ġf ig
Ġp ict
Ġm ission
Ġse lection
ol ved
ĠO ppenheimer
ac ed
ĠN est
ĠSo ft
end ing
ĠAn ne
ĠL ive
Ġsp ent
Ġsp lit
Ġstrong ly
ĠV ideo
Ġtal ent
Ġtrans p
ĠSt ates
Ġcons erv
Ġbenef ited
Ġam b
Ġent husi
Ġdesign s
Ġupd ates
Ġcontribut ed
Ġreturn s
Ġqual itative
Ġjoin ed
Ġvis ual
Ġforecast ing
Ġel astic
Ġintern al
ĠPa ul
Ġadopt ed
Ġnecess ary
Ġfoot pr
Ġroadm ap
chand ani
ĠKid ron
ĠDass en
M C
M ay
b y
t ick
u ations
er d
it es
Ġf it
ĠC it
ĠM itch
ĠM iller
ĠD ouglas
Ġst e
Ġst ab
oo st
am ing
ĠB l
ĠH sun
ĠL aura
ter a
cl oud
Ġsign s
Ġspec ial
Ġdiscuss ing
pl ish
Ġsim pl
ĠNe xt
Ġexce ption
Ġtra vel
ra ig
ĠGe orge
Ġlith ography
Ġhour s
Ġaggress ive
Ġsubscri bers
Ġphys ical
Ġappropri ate
Ġindivid ual
App le
Ġrespective ly
ĠFund a
ĠGre ater
3 00
B layne
h p
s h
u x
re y
en gth
Ġb udg
Ġb rought
Ġh ar
ĠC olin
im o
ĠD DR
Ġde lay
ĠB rent
ĠTh ings
ĠN av
Ġus es
Ġim agine
ec k
ĠQ LC
our th
Ġsa v
Ġ4 00
Ġact iv
Ġch arg
Ġass ist
ertain ly
Ġbr ands
ĠComp anies
Ġtotal ed
Ġgot ten
Ġbenefit ing
Ġwa it
Ġins ight
Ġhear ing
Ġrest rict
Ġcontribut ing
Ġpurch asing
Ġvari ability
Ġsur ve
Ġemp ower
Ġhop efully
umm it
Ġdistribut ion
Ġconstrain ts
Ġproble ms
Ġbuyb acks
Ġhistor ically
ĠDes hp
Ġdepend s
Ġdemonstr ated
Ġlith o
Ġchoo se
grow ing
incip al
Ġcapt ure
Ġtou ch
Ġrestruct uring
Ġsurpris ed
Ġbread th
Ġfootpr int
ĠDeshp ande
6 8
D ouglas
M ichael
o le
p ass
t es
v ol
Ġt em
Ġc amer
Ġp ilot
Ġg round
Ġl o
ver se
Ġe lements
ĠM er
ĠM et
Ġex it
ĠIn ter
ot era
ĠB h
ap t
Ġso cial
Ġ3 6
Ġ3 9
Ġ3 00
Ġnew er
Ġlook ed
ĠV ijay
ward s
anc ed
Ġadd itions
ĠK arl
Ġfin ish
Ġfl ows
Ġoff ice
Ġprocess es
Ġ9 6
ĠPro cess
Ġacc ord
Ġext ens
Ġhighl ights
Ġsharehold er
Ġmeaning fully
ĠUn it
ĠMo erd
Ġcontain s
ĠToshi ro
ĠPh il
Ġaccom plish
ĠCustom ers
ĠWor ld
Ġcharacter ize
Ġenj oy
Ġdisp lay
Ġdatab ase
May be
ĠFunda mental
ĠMoerd ler
6 6
J oseph
M I
g ed
i ber
l ies
x ico
z e
re ced
Ġf elt
Ġm er
Ġm usic
ro om
Ġg lo
Ġre iter
Ġl ump
Ġl ength
as k
ĠS ales
ch ain
ĠD ec
ĠD RI
Ġex cess
ĠP iper
ĠG erm
ĠG iven
ĠWe iss
ac celer
um an
Ġj ump
ĠL ens
Ġte ch
Ġsp o
ag avath
Ġfl uct
ph y
Ġam ort
Ġmid point
Ġplay ers
Ġrequ ires
Ġclient s
ĠiPad s
ĠMe xico
Ġqual ification
ta ke
Ġshow ed
ĠMeh di
Ġuni qu
Ġdepend ing
Ġnecess arily
Ġunp reced
Ġcann ot
ĠSwitch ing
Ġcompli ance
ĠSKU s
Ġeval u
ĠSoft ware
Ġsav ings
ĠBh agavath
Ġunpreced ented
C ustom
O ver
b oard
k ow
p ers
p any
Ġ z
on y
Ġin ferencing
ĠC amp
ear ly
ĠS am
ĠS ATA
qu ar
ĠM c
ĠM ost
Ġst ory
Ġst ages
ĠIn otera
ĠP re
ĠO I
ul ate
ĠWe lcome
Ġsh ape
ĠH all
ĠL LP
Ġper fect
ĠJ en
Ġpre c
ous ly
Ġgre en
res p
ite ment
ĠWh ere
ĠEx change
Ġcontribut e
Ġcontribut or
Ġatt ribut
Ġdifferenti ation
Ġestim ates
dri ven
Ġvehic le
ĠAR PU
Ġencour age
cho ol
Ġcross over
Ġsiz able
Ġrais ing
ĠMos kow
Ġshar ing
Ġpenet ration
Ġsimp ly
Ġvend ors
Ġpict ure
Ġtransp aren
Ġglo be
ĠDRI VE
L ast
L aura
Ġw ind
ed ic
Ġg ap
ĠS M
Ġe lev
ill ed
ĠD u
ĠE ME
ĠE cho
ĠN o
Ġj oint
ĠH MI
ĠL P
Ġen s
Ġsp read
ĠV er
Ġun ified
Ġlast ly
ood s
ric k
Ġch ose
ĠAl tera
Ġpr act
ĠCl ark
Ġexc itement
Ġins ert
Ġcontribut ions
Ġrefer enced
Ġest ablish
Ġsc re
Ġeas ily
ĠComm ission
ĠHe alth
Ġrender ing
power ed
Ġtariff s
chang ed
Ġcampaign s
Ġblock chain
Ġexpl ain
Ġregul atory
Ġmag n
ĠCit i
8 8
B M
L ooking
U DA
a ul
h alf
i ver
o bs
w ell
y er
Ġ era
Ġo pp
Ġo bs
ĠC UDA
et ime
ĠS AP
ĠT r
Ġse at
Ġcon clus
ri fic
ĠG en
Ġexp os
Ġwas n
ĠH as
ĠL ian
Ġte ens
Ġ5 9
lic it
Ġsign ed
Ġcomput ation
olut ions
ĠWh ole
up s
Ġinst ance
Ġcar ri
ĠCon t
Ġtyp ical
Ġconsider ed
Ġroll ed
ĠHar chandani
Ġimm edi
Ġleg acy
Ġauthor ization
ĠAdd itionally
Ġrepe at
Ġelastic ity
quar ie
ĠMoskow itz
Ġens uring
I f
J oe
R T
S hannon
e w
h olland
Ġt ens
Ġt ied
er al
Ġo kay
Ġc ult
Ġb oost
an ani
Ġwe ighted
ĠA ut
ĠI yer
ĠC ard
ĠS ummit
ĠS olutions
art ing
art ment
ĠM ul
ĠD el
ĠD ary
ĠAnd rew
pp er
ĠF ild
ĠF iber
Ġimp lications
Ġres ili
Ġout lined
Ġapp ear
Ġsp an
Ġsp ot
Ġhas n
ĠSt eve
Ġcomm erce
Ġenter tain
Ġvers ion
Ġsupport ed
ib r
Ġinf lection
Ġsomet imes
ĠHold ings
Ġexamp les
Ġbal anced
Ġgain ing
Ġreach ing
ĠNe edham
Ġenab led
Ġretail ers
Ġsustain ability
Ġgr ad
Ġencour aged
Ġcommunic ation
ĠCustom er
Ġattract ive
Ġtrust ed
Ġdeceler ation
Al phabet
Ġlaptop s
ĠFort une
Ġsummar ize
Ġactiv ities
Ġcharg es
ĠEME A
Ġexpos ure
ĠLian i
ĠMul holland
ĠDary anani
ĠFild es
D ynamics
R omit
d emand
g ig
l ets
u k
u able
Ġt w
it iveness
ent ly
om in
ear ning
ĠT ill
Ġis n
Ġmo ves
Ġgro c
ad a
ĠB ased
ĠG o
ĠG ill
Ġup tick
Ġgo als
ĠF arhan
ĠF ourth
Ġproduct ive
Ġad vanc
Ġsu ite
ĠL ike
Ġma x
irst ead
Ġser ies
Ġcall ing
Ġun changed
ell ing
Ġ4 6
ĠIt tai
Ġwork force
Ġdiffer ences
Ġgener ating
Ġstrength en
Ġassum ption
Ġcompet e
Ġcompet itiveness
Ġindic ation
enc er
Ġposition ing
Ġspe ech
Ġdetail ed
Ġmin im
Ġsur pass
ĠKe irstead
Ġstruct ural
Ġextend ed
Ġdis ru
Ġtri ed
ĠDo es
ĠSp encer
Ġconstrain ed
Ġmeasure d
Ġpe ak
Ġeduc ation
ĠLe vel
Ġsyn erg
He ather
Ġconstruct ion
comm erce
Ġaccret ive
Ġfig ure
ĠGerm any
Ġuniqu ely
7 5
A f
B ob
I C
N VIDIA
N omura
d ing
f irst
r ink
Ġ x
er ed
Ġs k
al ys
Ġf ine
ro log
st one
Ġh on
us ed
ĠT w
ĠM CP
Ġas pects
Ġit em
Ġpro position
Ġu nd
ate ver
ĠP SG
ĠB oth
ĠB road
ĠN umber
Ġad apt
ĠCE S
Ġ4 2
Ġ4 4
Ġcomm od
os en
Ġla id
Ġexper t
Ġgener ations
Ġramp ed
Ġbet s
Ġexc use
Ġdet erm
Ġdeep ly
Ġseason ally
Ġeffect s
ĠCan ada
ĠSem i
Ġgeograph y
Ġrefer red
Ġintern ally
Ġform ats
Ġrepresent ing
Ġthought ful
ĠComput er
ĠAD AS
Ġconvers ational
Just in
Ġdram atic
Ġaccom pany
Ġcaut ion
ĠAssoci ate
ĠProduct ivity
Ġrecommend ation
Ġdivers ified
ĠAir Pod
ĠFPG As
ĠGD P
Ġter rific
Ġlever aging
Ġalgorith ms
invest or
ĠInter im
ĠMc Af
Ġelev ated
Ġmagn itude
alys is
rolog y
ĠMcAf ee
7 3
7 8
J im
P ierre
R a
S imona
a gh
c ade
d ucing
l oud
u ild
er o
Ġo ption
Ġf ace
ed ia
ic ustom
Ġh iring
ĠC arl
ĠS ac
Ġe lement
ch ow
ĠT S
Ġwh atever
Ġex tern
Ġmo v
Ġan alysis
el f
ac c
Ġsh rink
Ġexp licit
ĠN X
Ġcomp elling
ĠF oods
Ġtr acking
ond ing
Ġind ependent
Ġ4 9
Ġincl us
Th ere
ĠTe am
ĠAl so
ĠAd am
Ġpr ud
con agh
ĠPro v
Ġeng aging
Ġvari able
Ġkeep ing
Ġtarget ed
Ġrev olution
Ġorgan ic
Ġconsistent ly
Ġthought fully
ĠKe vin
Ġpublish ers
Ġextend ing
Ġbuy ers
Ġcor resp
prem ise
Ġperform ed
Ġconcern s
Ġaggress ively
ĠFPG A
Ke vin
Ġwareh ous
Ġtit les
Ġword s
Ġimpress ive
ĠLens chow
ĠAirPod s
ĠSac conagh
ĠSacconagh i
B ook
C an
J efferies
M itch
P ro
T wo
W hen
e ed
f ront
p ere
u ly
er en
on i
al le
is m
Ġm itig
Ġm iss
Ġn anometers
Ġse am
Ġse lect
ĠD ep
ĠR ec
ĠR omit
Ġde fer
ad ish
se ll
ant ly
Ġcomp lic
um er
fer ences
Ġimp lied
Ġv ide
Ġout p
Ġ4 8
ag adish
Ġevery where
Ġch o
Ġpoint ed
ak i
Ġpartn ering
oin ing
Ġsl ower
Ġcre ation
Ġcre dit
Ġstrateg ically
Ġval uable
Ġent ry
Ġchannel s
Ġperiod s
Ġev olution
Ġtarget ing
Ġcommun ities
Ġemploye e
Ġroll out
ĠStr ong
Ġwin ning
Ġrenew als
Ġtough er
Ġwr ite
Ġpattern s
Ġtele phone
Ġcongr ats
Ġmat ure
Ġsem icustom
Wh at
Ġsched ule
Ġfunct ional
ĠCas o
ongr atulations
ĠBl ack
ĠMer aki
ĠProcess es
Ġmer ch
Ġgreen field
ĠVer ily
ĠTS MC
Ġcorresp onding
Ġseam less
Ġcomplic ated
B MO
E R
E ric
F i
F lex
G R
J ames
M M
W AN
a x
a ving
a uc
b or
d er
g ree
p or
u ho
Ġt able
Ġc ir
an ch
Ġd rop
Ġl ab
Ġn av
ig ate
id ge
ation ally
Ġare n
ĠW i
Ġmo t
ot ain
ĠB P
ĠB e
ĠB en
per form
il ed
ul ated
all ed
Ġexp ir
Ġexp lo
ĠN ot
Ġcomp s
ĠF auc
ĠAn n
Ġtr uly
Ġwor se
ind ra
Ġli ves
iz uho
Ġany where
Ġco verage
Ġgood s
ef ined
Th ird
Ġ6 2
ĠApp Dynamics
ĠAm pere
Ġthem selves
Ġbuild s
Ġstrateg ies
con ference
Ġremain ed
Ġview s
ĠMan ney
Ġinf otain
Ġmove ment
Ġplay ed
Ġgain ed
iconduct or
ams i
Ġmeet ings
Ġsub se
ĠEn gine
rn est
Ġadjust ed
Ġconvers ation
Ġtend s
Ġexclud e
Ġflex ible
Ġ45 1
Ġmed ia
Ġdisclo s
yper Flex
Ġprom ot
AS ML
Ġaud ience
Ġchoo sing
Ġsiz es
Ġproper ties
Ġcongr atulations
Ġsamp ling
Ġdescri bed
ĠCat alyst
Ġbill ings
ĠTer ry
Ġconserv ative
Ġstab il
Ġsurve y
Ġtem por
Ġinsert ion
Ġopp osed
Ġcult ure
Ġmax im
ĠNX E
Ġvide os
ĠFauc ette
Ġinfotain ment
% ;
A aron
C S
I s
M ill
O B
P aul
R oger
i w
i ent
j v
l u
s pecific
in ear
in ux
or ning
es h
ing ly
Ġd ur
Ġg l
Ġl inear
ĠC ar
ĠC ort
ĠS et
ĠS ince
ĠT wo
Ġfor th
ĠM edia
Ġst ead
ĠR od
ĠW ins
ri ve
ĠP at
ĠG reat
ĠG row
ĠN SG
Ġint u
ĠH yperFlex
Ġac cept
ĠL inux
ore d
ĠU K
ell o
Ġact ively
ail ing
ĠAm ong
Ġkn own
ĠEx clud
Ġlead ers
Ġsegment ation
Ġdig estion
ib al
ems en
Ġconf ig
Ġtax es
ĠPr incipal
Ġwa ve
ĠMac Mill
Ġprep ar
Ġmet rology
Ġaddress ing
Ġvir us
Ġloc ation
Ġart ic
Ġiniti ative
Ġcompare s
Ġthreat s
Ġconcern ed
ĠEvery one
onal d
Ġalign ed
ĠSi emsen
Ġcann ibal
Ġmoder ate
Ġproper ty
Ġrobot ics
ĠGD DR
Ġident ify
Ġdom est
Ġconvert ible
Ġrang es
Ġreiter ate
Ġspo ke
Over all
Ġconclus ion
Ġentertain ment
Ġsynerg ies
Ġund ers
Ġexpert ise
jv indra
ĠCort ana
ĠMacMill an
0 8
7 9
E rnest
T r
] .
e ep
g en
h od
n et
Ġs olve
Ġc atch
Ġf re
Ġf irm
ed eral
ĠA ust
Ġh ol
Ġre b
ĠC CG
et t
ĠS BC
Ġfor ce
th y
Ġqu eries
id ed
ĠD id
ĠD emand
ĠW as
ĠP ol
ĠP eople
il o
ĠL ooking
li p
ĠJ on
ĠV eg
oun g
Ġbu nd
ĠK aty
Ġcould n
ag o
Ġsign al
Ġfin ancing
ĠAm brish
Ġch oice
Ġdisc over
Ġdeli vers
Ġacceler ator
Ġval id
az il
Ġret urning
Ġem br
Ġspecific s
ĠCl early
itch ard
Ġstand ing
ĠPr itchard
Ġupd ated
Ġintegr ate
Ġconnect ivity
Ġmet hod
att le
Ġparticip ate
la ke
Ġadjust ment
Ġconvers ion
Ġdr aw
Ġslow ing
Ġslow ed
Ġclar ity
Ġenhan ced
prem ises
Ġreconcili ations
ĠRak esh
Ġmig ration
ĠBr azil
Ġpe ers
ĠSi ri
ĠRed stone
Ġrein vent
Ġmic ro
Ġtab let
Ġgigaby tes
ĠRa imo
Ġfundament ally
Ġsk ill
Ġhon est
Ġcommod ity
ĠWins low
ĠExclud ing
7 1
7 2
C loud
D RAM
D ave
G e
O ne
T otal
T oshi
a ut
a ight
d en
d efined
j ee
Ġ #
in ation
Ġa ware
Ġa ug
ar ch
es man
Ġb ak
Ġb unch
Ġd edic
ĠI C
ĠI BM
Ġre act
Ġe lect
qu are
im ate
Ġex iting
ĠP X
il ies
ĠG ame
ĠL at
ĠL ook
Ġstr aight
Ġsp ort
ĠV i
ĠCh atter
Ġ4 3
ĠK ore
Ġ5 7
Ġfl ash
Ġmix ed
ĠEx pects
Ġdeliver ies
Ġar g
Ġcre ates
ĠPro gram
dig its
Ġoffset ting
atch ed
Ġpurch ased
Ġqual ify
Ġcent ral
Ġoptim ized
Ġmain ly
Ġform at
Ġaff ord
Ġloc ations
Ġlat ency
Ġfam ilies
ani el
Ġorig inally
Ġdemonstr ate
Ġmodest ly
ĠMos esman
Ġanalyst s
Ġtab lets
Ġstud ents
Ġcard s
ĠEd ge
Ġgigaby te
ĠMur phy
ĠCons umer
Ġworkst ations
Ġlo ad
Ġprud ent
Ġmerch ants
Ġaug ment
Ġbak ed
ĠChatter jee
ĠMosesman n
4 00
7 6
8 5
8 00
J C
J U
J PMorgan
N athanson
P h
R e
Y oung
a ks
b l
c ape
d ate
Ġc opy
al ian
is ed
Ġm orning
Ġof ten
st ream
ĠA T
Ġg raph
as ure
ĠC A
ĠS ank
ut ral
ĠT ime
Ġbe at
ĠM atthew
Ġcom b
ĠE MS
Ġ1 50
Ġj obs
Ġim age
end s
Ġimp ly
ĠL ith
ren cy
ry n
Ġbec ame
Ġcons ist
ĠAS C
ĠTe le
Ġfl ag
ph as
ĠAP JC
Ġconstant ly
Ġadvertis er
Ġcapital ize
ĠMarket ing
ĠIS V
ĠLyn n
ath ryn
ĠMac quarie
Ġflat t
Ġachie ving
Ġoptim izing
Ġmanufact ur
Ġparticip ants
It tai
ra ft
Ġrepurch ased
34 00
Ġdr ag
Ġannual ized
Ġreview s
Ġpred omin
for ward
ĠMo han
Ġmed ical
ĠDes pite
Ġrenew al
Ġcomplex ity
Ġaud io
Ġrich er
Ad vanced
Ġfue led
ĠMur thy
Ġshif ting
Ġphenomen al
Ġbudg et
Ġfluct uations
Ġamort ization
Ġz ero
Ġwarehous es
Ġdomest ic
ett Nathanson
Ge orge
Toshi ya
Ph il
ĠSank ar
. -
7 7
C are
C lement
I O
M atthew
S kip
U ARY
a ily
h ir
m atched
p s
u ber
Ġa ir
Ġth in
Ġc uts
Ġb ear
Ġf le
Ġf ederal
Ġd uty
Ġd aily
Ġh or
Ġre form
Ġl and
ĠS ud
ĠS ky
ĠS ites
th ony
ĠD ell
ĠD av
Ġst acks
ĠR O
ĠR uss
pp ly
ven ues
ĠE ES
ĠO ut
out s
Ġsh ut
Ġus ually
ĠDi Clement
