{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<unk>": 1,
      "<s>": 2,
      "</s>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "^": 65,
      "_": 66,
      "`": 67,
      "a": 68,
      "b": 69,
      "c": 70,
      "d": 71,
      "e": 72,
      "f": 73,
      "g": 74,
      "h": 75,
      "i": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "n": 81,
      "o": 82,
      "p": 83,
      "q": 84,
      "r": 85,
      "s": 86,
      "t": 87,
      "u": 88,
      "v": 89,
      "w": 90,
      "x": 91,
      "y": 92,
      "z": 93,
      "{": 94,
      "|": 95,
      "}": 96,
      "~": 97,
      "¡": 98,
      "¢": 99,
      "£": 100,
      "¤": 101,
      "¥": 102,
      "¦": 103,
      "§": 104,
      "¨": 105,
      "©": 106,
      "ª": 107,
      "«": 108,
      "¬": 109,
      "®": 110,
      "¯": 111,
      "°": 112,
      "±": 113,
      "²": 114,
      "³": 115,
      "´": 116,
      "µ": 117,
      "¶": 118,
      "·": 119,
      "¸": 120,
      "¹": 121,
      "º": 122,
      "»": 123,
      "¼": 124,
      "½": 125,
      "¾": 126,
      "¿": 127,
      "À": 128,
      "Á": 129,
      "Â": 130,
      "Ã": 131,
      "Ä": 132,
      "Å": 133,
      "Æ": 134,
      "Ç": 135,
      "È": 136,
      "É": 137,
      "Ê": 138,
      "Ë": 139,
      "Ì": 140,
      "Í": 141,
      "Î": 142,
      "Ï": 143,
      "Ð": 144,
      "Ñ": 145,
      "Ò": 146,
      "Ó": 147,
      "Ô": 148,
      "Õ": 149,
      "Ö": 150,
      "×": 151,
      "Ø": 152,
      "Ù": 153,
      "Ú": 154,
      "Û": 155,
      "Ü": 156,
      "Ý": 157,
      "Þ": 158,
      "ß": 159,
      "à": 160,
      "á": 161,
      "â": 162,
      "ã": 163,
      "ä": 164,
      "å": 165,
      "æ": 166,
      "ç": 167,
      "è": 168,
      "é": 169,
      "ê": 170,
      "ë": 171,
      "ì": 172,
      "í": 173,
      "î": 174,
      "ï": 175,
      "ð": 176,
      "ñ": 177,
      "ò": 178,
      "ó": 179,
      "ô": 180,
      "õ": 181,
      "ö": 182,
      "÷": 183,
      "ø": 184,
      "ù": 185,
      "ú": 186,
      "û": 187,
      "ü": 188,
      "ý": 189,
      "þ": 190,
      "ÿ": 191,
      "Ā": 192,
      "ā": 193,
      "Ă": 194,
      "ă": 195,
      "Ą": 196,
      "ą": 197,
      "Ć": 198,
      "ć": 199,
      "Ĉ": 200,
      "ĉ": 201,
      "Ċ": 202,
      "ċ": 203,
      "Č": 204,
      "č": 205,
      "Ď": 206,
      "ď": 207,
      "Đ": 208,
      "đ": 209,
      "Ē": 210,
      "ē": 211,
      "Ĕ": 212,
      "ĕ": 213,
      "Ė": 214,
      "ė": 215,
      "Ę": 216,
      "ę": 217,
      "Ě": 218,
      "ě": 219,
      "Ĝ": 220,
      "ĝ": 221,
      "Ğ": 222,
      "ğ": 223,
      "Ġ": 224,
      "ġ": 225,
      "Ģ": 226,
      "ģ": 227,
      "Ĥ": 228,
      "ĥ": 229,
      "Ħ": 230,
      "ħ": 231,
      "Ĩ": 232,
      "ĩ": 233,
      "Ī": 234,
      "ī": 235,
      "Ĭ": 236,
      "ĭ": 237,
      "Į": 238,
      "į": 239,
      "İ": 240,
      "ı": 241,
      "Ĳ": 242,
      "ĳ": 243,
      "Ĵ": 244,
      "ĵ": 245,
      "Ķ": 246,
      "ķ": 247,
      "ĸ": 248,
      "Ĺ": 249,
      "ĺ": 250,
      "Ļ": 251,
      "ļ": 252,
      "Ľ": 253,
      "ľ": 254,
      "Ŀ": 255,
      "ŀ": 256,
      "Ł": 257,
      "ł": 258,
      "Ń": 259,
      "--": 260,
      "----": 261,
      "--------": 262,
      "Ġt": 263,
      "----------------": 264,
      "in": 265,
      "Ġa": 266,
      "Ġth": 267,
      "==": 268,
      "er": 269,
      "on": 270,
      "re": 271,
      "--------------------------------": 272,
      "Ġw": 273,
      "Ġo": 274,
      "at": 275,
      "en": 276,
      "Ġs": 277,
      "Ġthe": 278,
      "Ġc": 279,
      "nd": 280,
      "ar": 281,
      "or": 282,
      "es": 283,
      "====": 284,
      "it": 285,
      "ing": 286,
      "ou": 287,
      "Ġin": 288,
      "Ġb": 289,
      "an": 290,
      "al": 291,
      "Ġf": 292,
      "Ġto": 293,
      "is": 294,
      "Ġp": 295,
      "Ġm": 296,
      "ion": 297,
      "Ġof": 298,
      "ro": 299,
      "Ġand": 300,
      "st": 301,
      "ed": 302,
      "Ġd": 303,
      "Ġwe": 304,
      "ent": 305,
      "ĠA": 306,
      "ll": 307,
      "Ġg": 308,
      "ur": 309,
      "om": 310,
      "ic": 311,
      "Ġy": 312,
      "ĠI": 313,
      "Ġh": 314,
      "Ġre": 315,
      "========": 316,
      "Ġl": 317,
      "ct": 318,
      "Ġthat": 319,
      "ve": 320,
      "as": 321,
      "ly": 322,
      "ĠC": 323,
      "ear": 324,
      "et": 325,
      "ĠS": 326,
      "------------------------------------------------": 327,
      "--------------------------------------------------------------------------------": 328,
      "Ġn": 329,
      "Ġyou": 330,
      "le": 331,
      "ver": 332,
      "Ġe": 333,
      "ch": 334,
      "ut": 335,
      "qu": 336,
      "us": 337,
      "Ġour": 338,
      "Ġon": 339,
      "ĠT": 340,
      "Ġfor": 341,
      "th": 342,
      "Ġbe": 343,
      "Ġis": 344,
      "ow": 345,
      "art": 346,
      "ill": 347,
      "Ġse": 348,
      "Ġwh": 349,
      "ig": 350,
      "im": 351,
      "ĠM": 352,
      "Ġqu": 353,
      "ay": 354,
      "id": 355,
      "================": 356,
      "Ġas": 357,
      "ment": 358,
      "ers": 359,
      "ith": 360,
      "ce": 361,
      "ation": 362,
      "ust": 363,
      "ĠD": 364,
      "Ġcon": 365,
      "Ġit": 366,
      "Ġst": 367,
      "Ġare": 368,
      "'s": 369,
      "est": 370,
      "Ġpro": 371,
      "Ġcom": 372,
      "ĠR": 373,
      "Ġwith": 374,
      "Ġex": 375,
      "Ġha": 376,
      "ĠW": 377,
      "ol": 378,
      "ere": 379,
      "Ġ[": 380,
      "Ġ-": 381,
      "oo": 382,
      "ess": 383,
      "ĠAnd": 384,
      "Ġmo": 385,
      "ri": 386,
      "pp": 387,
      "Ġu": 388,
      "ven": 389,
      "am": 390,
      "ue": 391,
      "Ġde": 392,
      "ir": 393,
      "ate": 394,
      "if": 395,
      "Ġyear": 396,
      "ld": 397,
      "Ġgro": 398,
      "ad": 399,
      "Ġ2": 400,
      "Ġan": 401,
      "ect": 402,
      "ĠE": 403,
      "rom": 404,
      "se": 405,
      "ĠIn": 406,
      "Ġne": 407,
      "ally": 408,
      "Ġab": 409,
      "ĠP": 410,
      "Ġfrom": 411,
      "ink": 412,
      "ot": 413,
      "ĠO": 414,
      "ĠB": 415,
      "Ġhave": 416,
      "ity": 417,
      "per": 418,
      "out": 419,
      "Ġr": 420,
      "igh": 421,
      "Ġquart": 422,
      "ke": 423,
      "uct": 424,
      "ort": 425,
      "il": 426,
      "Ġthink": 427,
      "ĠTh": 428,
      "Ġgrow": 429,
      "ss": 430,
      "ab": 431,
      "ive": 432,
      "ul": 433,
      "ĠG": 434,
      "Ġthis": 435,
      "ge": 436,
      "Ġquarter": 437,
      "Ġcont": 438,
      "ĠWe": 439,
      "yst": 440,
      "Ġabout": 441,
      "'re": 442,
      "ant": 443,
      "el": 444,
      "Ġmar": 445,
      "all": 446,
      "Ġat": 447,
      "ac": 448,
      "Ġsh": 449,
      "Ġexp": 450,
      "ĠN": 451,
      "Ġus": 452,
      "ure": 453,
      "Ġwill": 454,
      "================================": 455,
      "ap": 456,
      "duct": 457,
      "ould": 458,
      "earch": 459,
      "ook": 460,
      "ome": 461,
      "em": 462,
      "illion": 463,
      "ĠDi": 464,
      "Ġcomp": 465,
      "Ġ$": 466,
      "um": 467,
      "Ġup": 468,
      "Ġinc": 469,
      "ain": 470,
      "Ġ1": 471,
      "Ġreven": 472,
      "Ġwas": 473,
      "ustom": 474,
      "ast": 475,
      "ies": 476,
      "Ġmore": 477,
      "Ġ--": 478,
      "Ġgrowth": 479,
      "very": 480,
      "ĠRes": 481,
      "and": 482,
      "iness": 483,
      "ĠSo": 484,
      "usiness": 485,
      "ard": 486,
      "Ġgo": 487,
      "Ġor": 488,
      "Ġj": 489,
      "Ġ20": 490,
      "Ġint": 491,
      "ĠH": 492,
      "estion": 493,
      "Ġbusiness": 494,
      "ments": 495,
      "Ġdo": 496,
      "Ġcustom": 497,
      "orm": 498,
      "ĠResearch": 499,
      "Ġim": 500,
      "Ġthere": 501,
      "ong": 502,
      "fer": 503,
      "end": 504,
      "Ġsee": 505,
      "Ġal": 506,
      "Ġrevenue": 507,
      "act": 508,
      "ĠF": 509,
      "are": 510,
      "un": 511,
      "Ġquestion": 512,
      "Ġproduct": 513,
      "lo": 514,
      "Ġso": 515,
      "ĠAn": 516,
      "Ġad": 517,
      "Ġimp": 518,
      "Ġtr": 519,
      "Ġcontin": 520,
      "perat": 521,
      "ich": 522,
      "so": 523,
      "rou": 524,
      "Ġac": 525,
      "Ġ&": 526,
      "Ġover": 527,
      "han": 528,
      "ec": 529,
      "Ġv": 530,
      "Ġjust": 531,
      "Ġwhat": 532,
      "form": 533,
      "Ġby": 534,
      "pt": 535,
      "Ġsu": 536,
      "og": 537,
      "alyst": 538,
      "ans": 539,
      "ĠL": 540,
      "ance": 541,
      "ĠAnalyst": 542,
      "ket": 543,
      "li": 544,
      "gin": 545,
      "ip": 546,
      "Ġwor": 547,
      "Ġ3": 548,
      "Ġstr": 549,
      "Ġexpect": 550,
      "Ġall": 551,
      "ions": 552,
      "Ġma": 553,
      "ĠInc": 554,
      "ts": 555,
      "Ġpo": 556,
      "ter": 557,
      "Ġres": 558,
      "vic": 559,
      "Ġsome": 560,
      "ond": 561,
      "Ġper": 562,
      "ase": 563,
      "gh": 564,
      "ial": 565,
      "Ġinv": 566,
      "Ġcustomers": 567,
      "ind": 568,
      "isc": 569,
      "ĠQ": 570,
      "Ġpl": 571,
      "ision": 572,
      "Ġwhich": 573,
      "Ġvery": 574,
      "irst": 575,
      "Ġnot": 576,
      "Ġhigh": 577,
      "ations": 578,
      "Ġcan": 579,
      "Ġbillion": 580,
      "ings": 581,
      "Ġyour": 582,
      "age": 583,
      "Ġnew": 584,
      "Ġcl": 585,
      "ĠJ": 586,
      "Ġpart": 587,
      "xt": 588,
      "ime": 589,
      "Ġ201": 590,
      "ated": 591,
      "ther": 592,
      "Ġdri": 593,
      "Ġout": 594,
      "Ġsec": 595,
      "ore": 596,
      "vision": 597,
      "ine": 598,
      "Ġme": 599,
      "ased": 600,
      "Ġli": 601,
      "ight": 602,
      "Ġmarket": 603,
      "ide": 604,
      "ks": 605,
      "ĠDivision": 606,
      "AN": 607,
      "Ġen": 608,
      "Ġgoing": 609,
      "Ġte": 610,
      "rect": 611,
      "Ġlike": 612,
      "Ġincre": 613,
      "'ve": 614,
      "Ġthan": 615,
      "oud": 616,
      "Ġalso": 617,
      "Ġlook": 618,
      "ence": 619,
      "Ġwell": 620,
      "Ġapp": 621,
      "Ġle": 622,
      "king": 623,
      "ition": 624,
      "iz": 625,
      "Ġmargin": 626,
      "ber": 627,
      "Ġser": 628,
      "Ġsp": 629,
      "Ġhow": 630,
      "Ġnext": 631,
      "Ġwould": 632,
      "Ġgu": 633,
      "Ġcall": 634,
      "Ġpre": 635,
      "perator": 636,
      "ous": 637,
      "Ġfirst": 638,
      "Ġhas": 639,
      "Ġbut": 640,
      "Ġnow": 641,
      "Ġrec": 642,
      "ren": 643,
      "chn": 644,
      "ĠCE": 645,
      "ud": 646,
      "Ġstrong": 647,
      "ĠV": 648,
      "enter": 649,
      "vices": 650,
      "ist": 651,
      "ward": 652,
      "ĠCEO": 653,
      "FO": 654,
      "ata": 655,
      "olog": 656,
      "Ġbeen": 657,
      "Operator": 658,
      "our": 659,
      "Ġk": 660,
      "ff": 661,
      "anc": 662,
      "chnolog": 663,
      "one": 664,
      "Ġgre": 665,
      "ĠThe": 666,
      "ie": 667,
      "Ġthen": 668,
      "Ġreally": 669,
      "ific": 670,
      "Ġif": 671,
      "able": 672,
      "Ġthey": 673,
      "Ġun": 674,
      "ose": 675,
      "ĠCh": 676,
      "ory": 677,
      "oc": 678,
      "oun": 679,
      "ON": 680,
      "Ġag": 681,
      "ack": 682,
      "ĠDirect": 683,
      "Ġresul": 684,
      "ĠMic": 685,
      "op": 686,
      "Ġany": 687,
      "Ġcontinue": 688,
      "ign": 689,
      "ĠDirector": 690,
      "Ġdata": 691,
      "Ġsa": 692,
      "ĠY": 693,
      "Ġinvest": 694,
      "Ġinto": 695,
      "Ġcloud": 696,
      "Ġlast": 697,
      "Ġco": 698,
      "pport": 699,
      "Ġta": 700,
      "Ġtal": 701,
      "Ġmillion": 702,
      "00": 703,
      "chnology": 704,
      "ood": 705,
      "res": 706,
      "erm": 707,
      "'ll": 708,
      "ving": 709,
      "ile": 710,
      "ning": 711,
      "any": 712,
      "Ġsecond": 713,
      "Ġtime": 714,
      "ens": 715,
      "ior": 716,
      "ities": 717,
      "Ġone": 718,
      "Ġtrans": 719,
      "year": 720,
      "cri": 721,
      "ross": 722,
      "Ġforward": 723,
      "cl": 724,
      "Ġbit": 725,
      "Ġwhere": 726,
      "oth": 727,
      "Ġcontinu": 728,
      "day": 729,
      "Ġcur": 730,
      "ystem": 731,
      "Ġthose": 732,
      "ĠU": 733,
      "Ġind": 734,
      "Ġdem": 735,
      "Ġterm": 736,
      "ĠSen": 737,
      "rough": 738,
      "ĠBut": 739,
      "HE": 740,
      "ft": 741,
      "orp": 742,
      "ĠSenior": 743,
      "'t": 744,
      "be": 745,
      "Ġget": 746,
      "Ġother": 747,
      "ep": 748,
      "cess": 749,
      "Ġproducts": 750,
      "Ġchan": 751,
      "ric": 752,
      "Ġcap": 753,
      "ility": 754,
      "ell": 755,
      "Ġpoin": 756,
      "over": 757,
      "Ġear": 758,
      "ĠSt": 759,
      "use": 760,
      "Ġbu": 761,
      "Ġadd": 762,
      "ious": 763,
      "ĠCFO": 764,
      "Ġwere": 765,
      "Ġdemand": 766,
      "orpor": 767,
      "ead": 768,
      "Ġshare": 769,
      "Ġtalk": 770,
      "ite": 771,
      "amp": 772,
      "Ġ4": 773,
      "Ġtheir": 774,
      "Ġresults": 775,
      "Ġmay": 776,
      "own": 777,
      "ĠK": 778,
      "Ġ5": 779,
      "ry": 780,
      "Ġhad": 781,
      "vers": 782,
      "Ġrem": 783,
      "Ġthrough": 784,
      "Ġdif": 785,
      "Ġact": 786,
      "ially": 787,
      "ident": 788,
      "uch": 789,
      "Ġcould": 790,
      "ris": 791,
      "eter": 792,
      "Ġbec": 793,
      "Ġfe": 794,
      "ĠIt": 795,
      "iv": 796,
      "Ġthese": 797,
      "Ġtoday": 798,
      "VI": 799,
      "etw": 800,
      "perating": 801,
      "Ġgross": 802,
      "Ġwork": 803,
      "elp": 804,
      "cript": 805,
      "Ġwhen": 806,
      "Ġcomm": 807,
      "Ġacross": 808,
      "Ġhelp": 809,
      "ced": 810,
      "ference": 811,
      "look": 812,
      "Ġgood": 813,
      "nder": 814,
      "ĠYou": 815,
      "ail": 816,
      "ame": 817,
      "ach": 818,
      "gan": 819,
      "Ġcurren": 820,
      "ef": 821,
      "Ġcons": 822,
      "itt": 823,
      "Ġimpact": 824,
      "formance": 825,
      "ors": 826,
      "Ġterms": 827,
      "ause": 828,
      "Ġboth": 829,
      "Ġstart": 830,
      "ics": 831,
      "Ġincl": 832,
      "AP": 833,
      "Ġrep": 834,
      "ag": 835,
      "ĠSu": 836,
      "Ġdown": 837,
      "ĠAS": 838,
      "io": 839,
      "ull": 840,
      "ener": 841,
      "her": 842,
      "Ġmake": 843,
      "gr": 844,
      "ecut": 845,
      "RA": 846,
      "RE": 847,
      "Ġinclud": 848,
      "old": 849,
      "Ġline": 850,
      "ĠTHE": 851,
      "ital": 852,
      "Ġgreat": 853,
      "ord": 854,
      "ix": 855,
      "Th": 856,
      "Ġcost": 857,
      "ron": 858,
      "Ġlot": 859,
      "Than": 860,
      "Ġdiffer": 861,
      "ware": 862,
      "ĠMD": 863,
      "ress": 864,
      "Ġwant": 865,
      "And": 866,
      "ank": 867,
      "Ġi": 868,
      "ĠMicro": 869,
      "ĠCorpor": 870,
      "Ġseg": 871,
      "alf": 872,
      "ĠMar": 873,
      "Ġprov": 874,
      "Ġlong": 875,
      "ays": 876,
      "ĠCo": 877,
      "lic": 878,
      "ower": 879,
      "Ġsign": 880,
      "Ġback": 881,
      "Ġfin": 882,
      "ĠVP": 883,
      "Ġnum": 884,
      "================================================": 885,
      "================================================================================": 886,
      "ĠEU": 887,
      "tain": 888,
      "Ġopport": 889,
      "Ġopportun": 890,
      "oog": 891,
      "ĠTe": 892,
      "ace": 893,
      "ler": 894,
      "ough": 895,
      "oogle": 896,
      "Ġevery": 897,
      "Ġend": 898,
      "ble": 899,
      "Ġ6": 900,
      "round": 901,
      "ĠGoogle": 902,
      "Ġsay": 903,
      "Ġhalf": 904,
      "ĠCorporation": 905,
      "Ġmuch": 906,
      "ystems": 907,
      "AAP": 908,
      "ade": 909,
      "PU": 910,
      "ocus": 911,
      "ĠIN": 912,
      "Ġperformance": 913,
      "ĠApp": 914,
      "uring": 915,
      "Ġkind": 916,
      "ary": 917,
      "Ġright": 918,
      "Ġoperating": 919,
      "VID": 920,
      "Ġfocus": 921,
      "ĠAm": 922,
      "ash": 923,
      "Ġ10": 924,
      "Ġimpro": 925,
      "atform": 926,
      "Ġann": 927,
      "'m": 928,
      "20": 929,
      "Ġch": 930,
      "Ġunder": 931,
      "Ġstate": 932,
      "Ġbecause": 933,
      "vel": 934,
      "ancial": 935,
      "os": 936,
      "Ġcenter": 937,
      "Ġlitt": 938,
      "Ġlittle": 939,
      "ĠPres": 940,
      "ĠPresident": 941,
      "ates": 942,
      "Ġguid": 943,
      "Ġaround": 944,
      "av": 945,
      "Ġseeing": 946,
      "Ġrel": 947,
      "vious": 948,
      "Ġmod": 949,
      "Ġfl": 950,
      "Ġmost": 951,
      "arg": 952,
      "Ġfact": 953,
      "pris": 954,
      "Ġcustomer": 955,
      "Ġdisc": 956,
      "ĠCap": 957,
      "Ġcomes": 958,
      "ĠDe": 959,
      "Ġplatform": 960,
      "Ġcomput": 961,
      "Ġass": 962,
      "ph": 963,
      "ateg": 964,
      "Ġhigher": 965,
      "ertain": 966,
      "Yes": 967,
      "ĠCom": 968,
      "ION": 969,
      "LC": 970,
      "Ġdriven": 971,
      "Ġthings": 972,
      "ĠiP": 973,
      "olut": 974,
      "ĠOur": 975,
      "RAM": 976,
      "ily": 977,
      "oll": 978,
      "ason": 979,
      "In": 980,
      "celer": 981,
      "Ġpoint": 982,
      "ount": 983,
      "Ġappro": 984,
      "Ġsaid": 985,
      "ative": 986,
      "ificant": 987,
      "%.": 988,
      "pect": 989,
      "bs": 990,
      "ild": 991,
      "Ġthem": 992,
      "Ġimport": 993,
      "LI": 994,
      "yn": 995,
      "cy": 996,
      "Ġmix": 997,
      "Ġsignificant": 998,
      "ĠDRAM": 999,
      "Ġagain": 1000,
      "Ġworld": 1001,
      "Ġnumber": 1002,
      "Ġfull": 1003,
      "Ġservices": 1004,
      "looking": 1005,
      "ffic": 1006,
      "Ġla": 1007,
      "ak": 1008,
      "Ġindust": 1009,
      "Ġactu": 1010,
      "ĠTechnology": 1011,
      "AND": 1012,
      "Ġenter": 1013,
      "urn": 1014,
      "Ġdeli": 1015,
      "Ġoff": 1016,
      "ĠWh": 1017,
      "ales": 1018,
      "ĠNAND": 1019,
      "Ġdifferent": 1020,
      "RI": 1021,
      "Ġlevel": 1022,
      "Ġpric": 1023,
      "Ġgam": 1024,
      "velo": 1025,
      "ĠThis": 1026,
      "cent": 1027,
      "Ġbas": 1028,
      "lease": 1029,
      "Ġmon": 1030,
      "Ġno": 1031,
      "Ġkn": 1032,
      "eop": 1033,
      "Ġcash": 1034,
      "Ġneed": 1035,
      "Ġ7": 1036,
      "ately": 1037,
      "ire": 1038,
      "Ġimportant": 1039,
      "Ġyears": 1040,
      "%,": 1041,
      "ĠAs": 1042,
      "Ġ2019": 1043,
      "eve": 1044,
      "Ġtechnology": 1045,
      "etwor": 1046,
      "ollow": 1047,
      "Ġway": 1048,
      "ird": 1049,
      "Ġstill": 1050,
      "Ġexper": 1051,
      "ular": 1052,
      "Ġro": 1053,
      "ĠInt": 1054,
      "prise": 1055,
      "Ġfollow": 1056,
      "ĠEx": 1057,
      "Ġsupp": 1058,
      "isco": 1059,
      "ruct": 1060,
      "Ġrate": 1061,
      "no": 1062,
      "Ġport": 1063,
      "Ġguidance": 1064,
      "Ġbig": 1065,
      "Ġpos": 1066,
      "Ġbuild": 1067,
      "Ġob": 1068,
      "unch": 1069,
      "rap": 1070,
      "Ġgener": 1071,
      "Ġbeli": 1072,
      "Ġpri": 1073,
      "ĠAl": 1074,
      "Ġdevelo": 1075,
      "ĠApple": 1076,
      "ĠAN": 1077,
      "viously": 1078,
      "iew": 1079,
      "Ex": 1080,
      "Ġsales": 1081,
      "Ġacceler": 1082,
      "Ġbased": 1083,
      "Ġoverall": 1084,
      "Ġknow": 1085,
      "eople": 1086,
      ".,": 1087,
      "Ġreal": 1088,
      "vent": 1089,
      "anom": 1090,
      "Ġramp": 1091,
      "Ġrecord": 1092,
      "Ġchang": 1093,
      "ree": 1094,
      "ating": 1095,
      "We": 1096,
      "ited": 1097,
      "Ġtake": 1098,
      "ty": 1099,
      "soft": 1100,
      "Ġdes": 1101,
      "ĠCO": 1102,
      "ob": 1103,
      "Ġbelieve": 1104,
      "its": 1105,
      "Ġnon": 1106,
      "vice": 1107,
      "Ġlaunch": 1108,
      "ĠCisco": 1109,
      "nings": 1110,
      "ĠAI": 1111,
      "Ġshould": 1112,
      "Ġpartn": 1113,
      "Our": 1114,
      "oin": 1115,
      "iscal": 1116,
      "Ġstatements": 1117,
      "ED": 1118,
      "Ġpartic": 1119,
      "Ġpeople": 1120,
      "Ġexperi": 1121,
      "Ġprocess": 1122,
      "ĠRe": 1123,
      "cal": 1124,
      "up": 1125,
      "Ġfinancial": 1126,
      "raph": 1127,
      "Ġbeing": 1128,
      "ability": 1129,
      "emory": 1130,
      "ention": 1131,
      "Ġlear": 1132,
      "organ": 1133,
      "ues": 1134,
      "Ġdon": 1135,
      "Ġlead": 1136,
      "man": 1137,
      "Ġannoun": 1138,
      "rans": 1139,
      "Ġman": 1140,
      "Ġmean": 1141,
      "ern": 1142,
      "Ġbr": 1143,
      "anometer": 1144,
      "gress": 1145,
      "Ġsegment": 1146,
      "Ġdeliver": 1147,
      "GAAP": 1148,
      "ĠIntel": 1149,
      "com": 1150,
      "ful": 1151,
      "tr": 1152,
      "Ġaut": 1153,
      "vert": 1154,
      "Ġbet": 1155,
      "ne": 1156,
      "Ġactually": 1157,
      "Ġdevelop": 1158,
      "anies": 1159,
      "ĠMicrosoft": 1160,
      "Ġimprove": 1161,
      "Ġgrew": 1162,
      "ĠComp": 1163,
      "uc": 1164,
      "lob": 1165,
      "ranscript": 1166,
      "ĠGPU": 1167,
      "Ġteam": 1168,
      "ting": 1169,
      "Ġtre": 1170,
      "Ġincrease": 1171,
      "Ġnetwor": 1172,
      "ES": 1173,
      "Ġapplic": 1174,
      "Ġside": 1175,
      "Ġprof": 1176,
      "quent": 1177,
      "ĠMicron": 1178,
      "Ġfiscal": 1179,
      "Ġmaybe": 1180,
      "ĠEUV": 1181,
      "Ġinvent": 1182,
      "ater": 1183,
      "Ġprior": 1184,
      "hone": 1185,
      "Ġtalked": 1186,
      "les": 1187,
      "ick": 1188,
      "Ġgive": 1189,
      "ether": 1190,
      "Ġeven": 1191,
      "ize": 1192,
      "Ġmention": 1193,
      "olio": 1194,
      "folio": 1195,
      "ual": 1196,
      "Ġcurrent": 1197,
      "Ġindustry": 1198,
      "gth": 1199,
      "Ġke": 1200,
      "agement": 1201,
      "AL": 1202,
      "Ġconst": 1203,
      "ĠLLC": 1204,
      "lect": 1205,
      "Ġcontinued": 1206,
      "Ġcompanies": 1207,
      "Thank": 1208,
      "Ġportfolio": 1209,
      "Ġar": 1210,
      "ical": 1211,
      "Ġopportunity": 1212,
      "ĠPC": 1213,
      "NT": 1214,
      "iven": 1215,
      "ENT": 1216,
      "Ġincreased": 1217,
      "IN": 1218,
      "nanometer": 1219,
      "Ġgrowing": 1220,
      "Ġincluding": 1221,
      "Ġsupply": 1222,
      "Ġcoming": 1223,
      "Ġ2018": 1224,
      "air": 1225,
      "ina": 1226,
      "Ġsaw": 1227,
      "Ġprovid": 1228,
      "Ġenterprise": 1229,
      "LE": 1230,
      "ult": 1231,
      "Ġsoft": 1232,
      "ANY": 1233,
      "ange": 1234,
      "Ġbetter": 1235,
      "vanc": 1236,
      "Ġdecl": 1237,
      "term": 1238,
      "cial": 1239,
      "Ġ9": 1240,
      "roup": 1241,
      "Ġprogress": 1242,
      "Ġspec": 1243,
      "Ġbasis": 1244,
      "Ġreg": 1245,
      "ures": 1246,
      "tal": 1247,
      "formation": 1248,
      "Ġlearning": 1249,
      "Ġmob": 1250,
      "ĠEqu": 1251,
      "Ġsl": 1252,
      "ecutive": 1253,
      "Ġmentioned": 1254,
      "Ġmargins": 1255,
      "imately": 1256,
      "rength": 1257,
      "itive": 1258,
      "Ġbusinesses": 1259,
      "ĠExecutive": 1260,
      "SC": 1261,
      "Ġmemory": 1262,
      "RAN": 1263,
      "Ġsequent": 1264,
      "EC": 1265,
      "ML": 1266,
      "hip": 1267,
      "Ġstrength": 1268,
      "PT": 1269,
      "cur": 1270,
      "ĠTRAN": 1271,
      "RIPT": 1272,
      "SCRIPT": 1273,
      "ĠTRANSCRIPT": 1274,
      "ĠAd": 1275,
      "Ġcre": 1276,
      "AT": 1277,
      "Ġvers": 1278,
      "Ġthird": 1279,
      "Ġpr": 1280,
      "Ġsupport": 1281,
      "Ġmy": 1282,
      "Ġmonth": 1283,
      "ple": 1284,
      "Ġben": 1285,
      "Ġstrateg": 1286,
      "Ġtotal": 1287,
      "lobal": 1288,
      "Ġsolut": 1289,
      "Ġhere": 1290,
      "Ġinventory": 1291,
      "Ġincreas": 1292,
      "fore": 1293,
      "ĠSec": 1294,
      "Ġseen": 1295,
      "Ġsoftware": 1296,
      "Ġmobile": 1297,
      "urity": 1298,
      "ĠThat": 1299,
      "Ġgaming": 1300,
      "Ġris": 1301,
      "Ġsort": 1302,
      "ĠAP": 1303,
      "vanced": 1304,
      "ercial": 1305,
      "Ġcour": 1306,
      "Ġenv": 1307,
      "Ġref": 1308,
      "iron": 1309,
      "ĠTranscript": 1310,
      "Ġsm": 1311,
      "Ġval": 1312,
      "Ġclo": 1313,
      "ows": 1314,
      "Ġassum": 1315,
      "Ġenviron": 1316,
      "con": 1317,
      "lay": 1318,
      "stand": 1319,
      "bin": 1320,
      "Ġmany": 1321,
      "ĠIR": 1322,
      "Ġinvestments": 1323,
      "az": 1324,
      "Ġret": 1325,
      "Ġcourse": 1326,
      "nov": 1327,
      "Ġdid": 1328,
      "arge": 1329,
      "Ġspend": 1330,
      "Ġbenef": 1331,
      "Ġconference": 1332,
      "Ġdep": 1333,
      "Ġinnov": 1334,
      "Ġlet": 1335,
      "ĠASML": 1336,
      "Ġav": 1337,
      "rian": 1338,
      "Ġpoints": 1339,
      "Ġapprox": 1340,
      "Ġcompet": 1341,
      "Ġem": 1342,
      "ĠBank": 1343,
      "Ġpercent": 1344,
      "Ġindic": 1345,
      "Ġship": 1346,
      "Ġord": 1347,
      "ĠChina": 1348,
      "Ġtrend": 1349,
      "ject": 1350,
      "ense": 1351,
      "Ġdou": 1352,
      "ption": 1353,
      "Ġannounced": 1354,
      "ĠSystems": 1355,
      "zure": 1356,
      "Ġincome": 1357,
      "Ġavail": 1358,
      "Ġapproximately": 1359,
      "MP": 1360,
      "Ġpartners": 1361,
      "Ġobviously": 1362,
      "uss": 1363,
      "ĠAzure": 1364,
      "ved": 1365,
      "Ġpers": 1366,
      "oment": 1367,
      "Ġmaking": 1368,
      "Ġaddition": 1369,
      "Ġam": 1370,
      "arily": 1371,
      "Ġdig": 1372,
      "Ġchanges": 1373,
      "IA": 1374,
      "ves": 1375,
      "Ġlarge": 1376,
      "Ġexpected": 1377,
      "Ġremain": 1378,
      "Ġfour": 1379,
      "Ġview": 1380,
      "Ġmoment": 1381,
      "Ġmarkets": 1382,
      "ĠiPhone": 1383,
      "Ġversus": 1384,
      "Ġ2020": 1385,
      "VIDIA": 1386,
      "Ġeff": 1387,
      "Ġdriving": 1388,
      "Ġmade": 1389,
      "Ġexecut": 1390,
      "Ġparticular": 1391,
      "Ġlower": 1392,
      "ional": 1393,
      "Ġplan": 1394,
      "Ġspecific": 1395,
      "Ġcurrency": 1396,
      "Ġmodel": 1397,
      "So": 1398,
      "Ġgiven": 1399,
      "Ġhe": 1400,
      "Ġservice": 1401,
      "Ġcomputing": 1402,
      "IS": 1403,
      "ĠBo": 1404,
      "Ġrecent": 1405,
      "'d": 1406,
      "19": 1407,
      "ering": 1408,
      "Ġhapp": 1409,
      "ically": 1410,
      "Ġquarters": 1411,
      "Ġcontent": 1412,
      "ib": 1413,
      "enc": 1414,
      "Ġcou": 1415,
      "loy": 1416,
      "Ġago": 1417,
      "vest": 1418,
      "ĠCl": 1419,
      "lier": 1420,
      "Ġrevenues": 1421,
      "Ġdiscuss": 1422,
      "Ġdoes": 1423,
      "ization": 1424,
      "OR": 1425,
      "ĠRE": 1426,
      "vertis": 1427,
      "CA": 1428,
      "Ġapplications": 1429,
      "Ġworking": 1430,
      "Ġenvironment": 1431,
      "ized": 1432,
      "CE": 1433,
      "son": 1434,
      "Ġturn": 1435,
      "ube": 1436,
      "Ġreason": 1437,
      "olid": 1438,
      "ĠAPP": 1439,
      "BLE": 1440,
      "uture": 1441,
      "Ġonly": 1442,
      "ĠOR": 1443,
      "The": 1444,
      "LICA": 1445,
      "ĠCOMP": 1446,
      "ĠAPPLICA": 1447,
      "ĠCOMPANY": 1448,
      "ĠAPPLICABLE": 1449,
      "Tube": 1450,
      "Ġconsum": 1451,
      "gram": 1452,
      "ĠCapEx": 1453,
      "Ġsame": 1454,
      "ĠMan": 1455,
      "ia": 1456,
      "Ġfuture": 1457,
      "Ġareas": 1458,
      "und": 1459,
      "ĠNVIDIA": 1460,
      "Ġcouple": 1461,
      "Ġcompany": 1462,
      "ĠYouTube": 1463,
      "ĠEP": 1464,
      "Ġcommercial": 1465,
      "Ġquestions": 1466,
      "Ġconstant": 1467,
      "ys": 1468,
      "Ġcertain": 1469,
      "Ġrange": 1470,
      "Ġadvertis": 1471,
      "Ġflow": 1472,
      "itect": 1473,
      "chitect": 1474,
      "ynam": 1475,
      "Ġguess": 1476,
      "pl": 1477,
      "Ġinf": 1478,
      "Ġhard": 1479,
      "Ġvalue": 1480,
      "ub": 1481,
      "65": 1482,
      "ems": 1483,
      "Ġcontinues": 1484,
      "cale": 1485,
      "Ġinter": 1486,
      "Ġearnings": 1487,
      "Ġfocused": 1488,
      "but": 1489,
      "ible": 1490,
      "Ġcapac": 1491,
      "yp": 1492,
      "Ġ2017": 1493,
      "itions": 1494,
      "Ġprogram": 1495,
      "Ġexpand": 1496,
      "ass": 1497,
      "Ġprim": 1498,
      "Ġinst": 1499,
      "ribut": 1500,
      "Ġincreasing": 1501,
      "Ġreflect": 1502,
      "fter": 1503,
      "red": 1504,
      "isa": 1505,
      "icip": 1506,
      "Ġdoing": 1507,
      "Ġunderstand": 1508,
      "Ġearlier": 1509,
      "Ġposition": 1510,
      "head": 1511,
      "Ġexc": 1512,
      "abet": 1513,
      "du": 1514,
      "Ġvol": 1515,
      "Thanks": 1516,
      "Ġfeel": 1517,
      "read": 1518,
      "phabet": 1519,
      "Ġsystems": 1520,
      "Ġdrive": 1521,
      "Ġlooking": 1522,
      "ĠInvest": 1523,
      "Ġop": 1524,
      "Ġwee": 1525,
      "urch": 1526,
      "Ġcomment": 1527,
      "Ġuse": 1528,
      "Ġcapacity": 1529,
      "Ġahead": 1530,
      "Ġearly": 1531,
      "Ġarchitect": 1532,
      "Ġduring": 1533,
      "Ġsecurity": 1534,
      "ice": 1535,
      "ared": 1536,
      "Ġ8": 1537,
      "Ġpret": 1538,
      "Ġprovide": 1539,
      "ĠCompany": 1540,
      "een": 1541,
      "road": 1542,
      "ish": 1543,
      "omet": 1544,
      "Ġserver": 1545,
      "ost": 1546,
      "Ġbase": 1547,
      "Ġcapital": 1548,
      "Ġwhile": 1549,
      "Ġable": 1550,
      "te": 1551,
      "Ġed": 1552,
      "Ġusers": 1553,
      "etween": 1554,
      "Ġbring": 1555,
      "ci": 1556,
      "ark": 1557,
      "ĠSer": 1558,
      "azon": 1559,
      "Ġpretty": 1560,
      "Ġent": 1561,
      "Ġbetween": 1562,
      "Ġsubs": 1563,
      "ound": 1564,
      "Ġtool": 1565,
      "urities": 1566,
      "Ġwho": 1567,
      "Ġconf": 1568,
      "Ġcome": 1569,
      "ptions": 1570,
      "Ġpercentage": 1571,
      "BS": 1572,
      "Ġafter": 1573,
      "ĠOffic": 1574,
      "Ġmult": 1575,
      "uth": 1576,
      "ĠHead": 1577,
      "Ġavailable": 1578,
      "ĠX": 1579,
      "Ġsomet": 1580,
      "Ġfourth": 1581,
      "Ġsolutions": 1582,
      "alth": 1583,
      "resent": 1584,
      "Ġfew": 1585,
      "Ġmach": 1586,
      "ying": 1587,
      "ably": 1588,
      "ĠHold": 1589,
      "oint": 1590,
      "ĠCloud": 1591,
      "based": 1592,
      "ĠAlphabet": 1593,
      "icha": 1594,
      "Ch": 1595,
      "Ġreport": 1596,
      "ĠCapital": 1597,
      "Ġmomentum": 1598,
      "ĠMorgan": 1599,
      "Ġsequentially": 1600,
      "Ġdouble": 1601,
      "Ġsure": 1602,
      "enses": 1603,
      "time": 1604,
      "Ġmove": 1605,
      "Ġclear": 1606,
      "ĠAmazon": 1607,
      "rast": 1608,
      "set": 1609,
      "Ġbroad": 1610,
      "ang": 1611,
      "arter": 1612,
      "Ġpricing": 1613,
      "Ġfactors": 1614,
      "hing": 1615,
      "thing": 1616,
      "ivity": 1617,
      "cast": 1618,
      "Ġdevices": 1619,
      "Ġits": 1620,
      "Ġrun": 1621,
      "elly": 1622,
      "ley": 1623,
      "Ġado": 1624,
      "Ġwond": 1625,
      "Ġexpectations": 1626,
      "ĠASP": 1627,
      "ructure": 1628,
      "Ġopen": 1629,
      "Ġput": 1630,
      "ĠCall": 1631,
      "Ġdec": 1632,
      "Ġinvestment": 1633,
      "Ġdue": 1634,
      "icon": 1635,
      "Ġopportunities": 1636,
      "ĠDevices": 1637,
      "Ġexperience": 1638,
      "Ġprofit": 1639,
      "ĠEquity": 1640,
      "ĠPro": 1641,
      "Ġacc": 1642,
      "Ġrelative": 1643,
      "TE": 1644,
      "jor": 1645,
      "ya": 1646,
      "Ġsim": 1647,
      "Ġcy": 1648,
      "ynamics": 1649,
      "ely": 1650,
      "nect": 1651,
      "od": 1652,
      "uters": 1653,
      "FE": 1654,
      "ĠMark": 1655,
      "rastructure": 1656,
      "wo": 1657,
      "acy": 1658,
      "Ġthough": 1659,
      "ĠEUR": 1660,
      "IONS": 1661,
      "ATION": 1662,
      "Ġ365": 1663,
      "Ġkey": 1664,
      "Ġvar": 1665,
      "ĠOn": 1666,
      "Ġexpenses": 1667,
      "Ġexamp": 1668,
      "ĠUS": 1669,
      "ĠHolding": 1670,
      "Ġlarg": 1671,
      "rel": 1672,
      "Ġbest": 1673,
      "Ġmajor": 1674,
      "other": 1675,
      "err": 1676,
      "Ġoffer": 1677,
      "Ġrisks": 1678,
      "Ġdet": 1679,
      "Ġsegments": 1680,
      "Ġprimarily": 1681,
      "ĠCON": 1682,
      "Ġext": 1683,
      "Ġunc": 1684,
      "Ġinnovation": 1685,
      "Ġcount": 1686,
      "Ġhead": 1687,
      "ĠMA": 1688,
      "REN": 1689,
      "THE": 1690,
      "eb": 1691,
      "Ġgot": 1692,
      "ĠCAL": 1693,
      "FOR": 1694,
      "ĠANY": 1695,
      "ĠAdvanced": 1696,
      "FEREN": 1697,
      "Ġuncertain": 1698,
      "ĠCALL": 1699,
      "FERENCE": 1700,
      "Ġsuc": 1701,
      "Ġpub": 1702,
      "Ġacqu": 1703,
      "Ġdesign": 1704,
      "Ġsomething": 1705,
      "ĠStan": 1706,
      "Ġhealth": 1707,
      "omson": 1708,
      "Ġbegin": 1709,
      "tern": 1710,
      "ĠMarket": 1711,
      "ĠReuters": 1712,
      "Ġvolum": 1713,
      "Ġtop": 1714,
      "Ġnear": 1715,
      "Ġintro": 1716,
      "10": 1717,
      "Ġtim": 1718,
      "Ġsearch": 1719,
      "Ġequ": 1720,
      "pping": 1721,
      "Ġdeep": 1722,
      "Ġanother": 1723,
      "Ġmid": 1724,
      "ĠStanley": 1725,
      "ied": 1726,
      "ational": 1727,
      "Ġwithin": 1728,
      "dig": 1729,
      "Ġthing": 1730,
      "ĠIf": 1731,
      "verage": 1732,
      "clud": 1733,
      "Ġusing": 1734,
      "Ġpress": 1735,
      "Ġoffset": 1736,
      "Ġmachine": 1737,
      "ein": 1738,
      "lient": 1739,
      "ift": 1740,
      "Ġguys": 1741,
      "Ġfast": 1742,
      "sw": 1743,
      "ingle": 1744,
      "ilities": 1745,
      "Ġtransition": 1746,
      "ĠSecurities": 1747,
      "ĠBoard": 1748,
      "Ġask": 1749,
      "Ġnetwork": 1750,
      "Ġset": 1751,
      "lex": 1752,
      "ĠGlobal": 1753,
      "ĠChair": 1754,
      "ĠChairman": 1755,
      "AC": 1756,
      "Ġweb": 1757,
      "ĠPart": 1758,
      "Ġchange": 1759,
      "Ġspending": 1760,
      "Ġsuccess": 1761,
      "Ġrelease": 1762,
      "ĠThere": 1763,
      "stein": 1764,
      "Ġwhy": 1765,
      "Ġgetting": 1766,
      "Ġmonths": 1767,
      "17": 1768,
      "Ġph": 1769,
      "ĠInst": 1770,
      "ĠGroup": 1771,
      "hn": 1772,
      "nel": 1773,
      "atch": 1774,
      "itch": 1775,
      "inder": 1776,
      "Ġoper": 1777,
      "Ġseason": 1778,
      "Ġquite": 1779,
      "cription": 1780,
      "Ġexample": 1781,
      "ĠSEC": 1782,
      "Ġquick": 1783,
      "Ġ30": 1784,
      "Ġautom": 1785,
      "kay": 1786,
      "Ġinformation": 1787,
      "raphics": 1788,
      "Ġpast": 1789,
      "Ġdi": 1790,
      "ants": 1791,
      "Ġtax": 1792,
      "bers": 1793,
      "leased": 1794,
      "ĠOr": 1795,
      "ĠThank": 1796,
      "Ġcar": 1797,
      "Ġcomments": 1798,
      "ĠEV": 1799,
      "ĠKr": 1800,
      "Ġbenefit": 1801,
      "18": 1802,
      "Ġ'": 1803,
      "Ġfore": 1804,
      "Ġassumptions": 1805,
      "ined": 1806,
      "ify": 1807,
      "ĠFin": 1808,
      "ĠManagement": 1809,
      "bably": 1810,
      "Ġbefore": 1811,
      "Ġ2016": 1812,
      "Ġdone": 1813,
      "load": 1814,
      "Ġoutlook": 1815,
      "Ġinfrastructure": 1816,
      "Ġinterest": 1817,
      "Ġbal": 1818,
      "Ġproduction": 1819,
      "Ġeffect": 1820,
      "digit": 1821,
      "Ġwhether": 1822,
      "ries": 1823,
      "Ġplatforms": 1824,
      "pective": 1825,
      "reat": 1826,
      "ĠIS": 1827,
      "Ġstand": 1828,
      "ready": 1829,
      "ove": 1830,
      "ines": 1831,
      "ets": 1832,
      "ograph": 1833,
      "Ġmeas": 1834,
      "Ġchannel": 1835,
      "ways": 1836,
      "Ġpower": 1837,
      "ĠPr": 1838,
      "ĠNon": 1839,
      "jay": 1840,
      "ases": 1841,
      "ock": 1842,
      "Ġprobably": 1843,
      "Ġstrategy": 1844,
      "Ġwa": 1845,
      "ĠFirst": 1846,
      "Ġacquis": 1847,
      "ĠMarkets": 1848,
      "Ġresult": 1849,
      "30": 1850,
      "Ġtwo": 1851,
      "ĠCan": 1852,
      "ĠFor": 1853,
      "000": 1854,
      "Ġwebs": 1855,
      "Ġtrends": 1856,
      "mi": 1857,
      "ohn": 1858,
      "erg": 1859,
      "Ġnet": 1860,
      "Ġplay": 1861,
      "ffici": 1862,
      "Ġplease": 1863,
      "ĠCon": 1864,
      "Ġunit": 1865,
      "Ġentire": 1866,
      "Ġupd": 1867,
      "Ġalways": 1868,
      "Ġcontinuing": 1869,
      "Now": 1870,
      "Ġgain": 1871,
      "Ġalready": 1872,
      "ogn": 1873,
      "Ġeng": 1874,
      "Ġcoll": 1875,
      "Ġhappen": 1876,
      "Ġsell": 1877,
      "ĠNow": 1878,
      "Lisa": 1879,
      "of": 1880,
      "oss": 1881,
      "ified": 1882,
      "Ġeveryone": 1883,
      "Ġdeploy": 1884,
      "Ġsystem": 1885,
      "Ġprice": 1886,
      "Ġins": 1887,
      "Ġlow": 1888,
      "ĠWind": 1889,
      "Ġvolume": 1890,
      "Ġwebsite": 1891,
      "Mark": 1892,
      "isse": 1893,
      "ĠSuisse": 1894,
      "Ġwanted": 1895,
      "Ġlevels": 1896,
      "Ġnod": 1897,
      "Ġimprovement": 1898,
      "Ġadditional": 1899,
      "Ġrequ": 1900,
      "ĠJust": 1901,
      "ield": 1902,
      "Ġtarg": 1903,
      "anks": 1904,
      "ĠIs": 1905,
      "ĠSem": 1906,
      "ĠGAAP": 1907,
      "action": 1908,
      "Ġ50": 1909,
      "16": 1910,
      "Ġyes": 1911,
      "Ġcombin": 1912,
      "ember": 1913,
      "Ġ12": 1914,
      "ĠLyn": 1915,
      "Ġbigg": 1916,
      "Ġarchitecture": 1917,
      "iconduct": 1918,
      "Ġcertainly": 1919,
      "Ġadvertising": 1920,
      "to": 1921,
      "ĠHu": 1922,
      "ellig": 1923,
      "Ġtyp": 1924,
      "Ġclient": 1925,
      "Ġshift": 1926,
      "Ġregard": 1927,
      "Ġspecifically": 1928,
      "Ġhear": 1929,
      "Ġupon": 1930,
      "PM": 1931,
      "ĠSe": 1932,
      "Ġeffici": 1933,
      "ĠThanks": 1934,
      "Brian": 1935,
      "bed": 1936,
      "ones": 1937,
      "Ġrest": 1938,
      "Ġfr": 1939,
      "ideo": 1940,
      "iod": 1941,
      "Ġcosts": 1942,
      "aps": 1943,
      "endent": 1944,
      "SD": 1945,
      "Ġmight": 1946,
      "ĠThey": 1947,
      "Ġclose": 1948,
      "ober": 1949,
      "Ġfree": 1950,
      "ĠIT": 1951,
      "Ġsuch": 1952,
      "Ġshipments": 1953,
      "ĠWindows": 1954,
      "As": 1955,
      "als": 1956,
      "Ġworkload": 1957,
      "ĠServices": 1958,
      "50": 1959,
      "Ġproject": 1960,
      "Ġability": 1961,
      "Ġspe": 1962,
      "Ġlonger": 1963,
      "Ġscale": 1964,
      "Ġpleased": 1965,
      "Ġshi": 1966,
      "ipment": 1967,
      "Ġbuilding": 1968,
      "ĠOffice": 1969,
      "line": 1970,
      "ath": 1971,
      "ĠSSD": 1972,
      "veral": 1973,
      "Ġcontribut": 1974,
      "Ġconsumer": 1975,
      "Ġwondering": 1976,
      "Okay": 1977,
      "gine": 1978,
      "Ġpositive": 1979,
      "Ġslight": 1980,
      "oing": 1981,
      "atya": 1982,
      "Ġfil": 1983,
      "ĠiPad": 1984,
      "top": 1985,
      "ency": 1986,
      "essional": 1987,
      "tra": 1988,
      "Ġdecline": 1989,
      "11": 1990,
      "EM": 1991,
      "Ġgraphics": 1992,
      "urther": 1993,
      "Ġperiod": 1994,
      "Ġrecogn": 1995,
      "ave": 1996,
      "less": 1997,
      "put": 1998,
      "Ġ(": 1999,
      "Ġless": 2000,
      "Ġparticularly": 2001,
      "ier": 2002,
      "enn": 2003,
      "ernstein": 2004,
      "duced": 2005,
      "ĠInvestor": 2006,
      "ams": 2007,
      "Ġexcited": 2008,
      "Ġdetail": 2009,
      "Ġcore": 2010,
      "ights": 2011,
      "errill": 2012,
      "ĠLynch": 2013,
      "point": 2014,
      "Ġseveral": 2015,
      "ĠMerrill": 2016,
      "ivid": 2017,
      "Ġlaunched": 2018,
      "uck": 2019,
      "Ġsingle": 2020,
      "ise": 2021,
      "abilities": 2022,
      "Ġinstall": 2023,
      "12": 2024,
      "inary": 2025,
      "Ġow": 2026,
      "urning": 2027,
      "Ġhardware": 2028,
      "qtr": 2029,
      "ties": 2030,
      "Ġqtr": 2031,
      "Ġinte": 2032,
      "ependent": 2033,
      "oldman": 2034,
      "ĠGPUs": 2035,
      "Ġperspective": 2036,
      "pec": 2037,
      "ĠSach": 2038,
      "une": 2039,
      "ĠSemiconduct": 2040,
      "ĠSachs": 2041,
      "Ġopt": 2042,
      "ĠAG": 2043,
      "Ġrelated": 2044,
      "ĠWhat": 2045,
      "cle": 2046,
      "Ġcal": 2047,
      "Ġge": 2048,
      "Ġnorm": 2049,
      "Ġbalance": 2050,
      "Ġcol": 2051,
      "Ġreach": 2052,
      "Ġevent": 2053,
      "Ġcapabilities": 2054,
      "Ġorders": 2055,
      "Ġintegr": 2056,
      "kes": 2057,
      "onom": 2058,
      "aly": 2059,
      "uts": 2060,
      "Ġadoption": 2061,
      "Ġpurch": 2062,
      "ĠTH": 2063,
      "ĠMe": 2064,
      "ĠRob": 2065,
      "ĠWith": 2066,
      "otent": 2067,
      "Ġinvesting": 2068,
      "Ġreturn": 2069,
      "Ġtools": 2070,
      "wh": 2071,
      "Ġpotent": 2072,
      "Ġmin": 2073,
      "ames": 2074,
      "ĠOEM": 2075,
      "Ġthinking": 2076,
      "aterially": 2077,
      "ĠPrime": 2078,
      "Ġown": 2079,
      "ĠMac": 2080,
      "Ġsmart": 2081,
      "Ġsmall": 2082,
      "ĠEPS": 2083,
      "Ġcolor": 2084,
      "OVID": 2085,
      "Ġtoward": 2086,
      "Ġqual": 2087,
      "ĠRel": 2088,
      "RS": 2089,
      "yb": 2090,
      "ĠBernstein": 2091,
      "Ġprep": 2092,
      "aw": 2093,
      "gether": 2094,
      "Ġtogether": 2095,
      "ibility": 2096,
      "Ġvari": 2097,
      "St": 2098,
      "Ġadv": 2099,
      "Ġleading": 2100,
      "Ġpay": 2101,
      "Ġlist": 2102,
      "ĠBE": 2103,
      "ĠAND": 2104,
      "EST": 2105,
      "let": 2106,
      "Ġ\"": 2107,
      "arl": 2108,
      "Ġ14": 2109,
      "Ġfeat": 2110,
      "Ġeach": 2111,
      "Ġ40": 2112,
      "Ġslightly": 2113,
      "Ġfurther": 2114,
      "ĠWenn": 2115,
      "ĠNe": 2116,
      "Ġresp": 2117,
      "Ġclos": 2118,
      "Ġweek": 2119,
      "Ġcycle": 2120,
      "ĠWennink": 2121,
      "eric": 2122,
      "arks": 2123,
      "core": 2124,
      "led": 2125,
      "Ġsense": 2126,
      "arcl": 2127,
      "Ġev": 2128,
      "ĠTO": 2129,
      "though": 2130,
      "Ġitems": 2131,
      "ĠOp": 2132,
      "arclays": 2133,
      "olve": 2134,
      "allen": 2135,
      "ĠHow": 2136,
      "ages": 2137,
      "Ġorder": 2138,
      "Am": 2139,
      "Ġweak": 2140,
      "ĠMa": 2141,
      "ĠEvent": 2142,
      "Ġcurious": 2143,
      "Ġroad": 2144,
      "ĠParticip": 2145,
      "CU": 2146,
      "ĠBrian": 2147,
      "Ġshort": 2148,
      "Ġthank": 2149,
      "Ġflat": 2150,
      "ĠRelations": 2151,
      "going": 2152,
      "Ġtoo": 2153,
      "Ġday": 2154,
      "ural": 2155,
      "lying": 2156,
      "ives": 2157,
      "ĠAmeric": 2158,
      "Ġstore": 2159,
      "venue": 2160,
      "Ġupgr": 2161,
      "istent": 2162,
      "Ġchallen": 2163,
      "ructions": 2164,
      "DE": 2165,
      "come": 2166,
      "ox": 2167,
      "wind": 2168,
      "ĠSw": 2169,
      "Ġedge": 2170,
      "ILI": 2171,
      "MENT": 2172,
      "MATION": 2173,
      "PON": 2174,
      "PRE": 2175,
      "ROVID": 2176,
      "SED": 2177,
      "VEST": 2178,
      "may": 2179,
      "ness": 2180,
      "ĠAll": 2181,
      "ĠARE": 2182,
      "Ġreduct": 2183,
      "ĠOF": 2184,
      "ĠOTHE": 2185,
      "Ġstarting": 2186,
      "ĠINFOR": 2187,
      "ĠINVEST": 2188,
      "ING": 2189,
      "ECIS": 2190,
      "curate": 2191,
      "ĠCONFERENCE": 2192,
      "ĠMADE": 2193,
      "ĠEVENT": 2194,
      "CURA": 2195,
      "ĠOTHER": 2196,
      "ĠINFORMATION": 2197,
      "ĠINVESTMENT": 2198,
      "ECISIONS": 2199,
      "Ġsit": 2200,
      "Ġinit": 2201,
      "abor": 2202,
      "ins": 2203,
      "Ġiss": 2204,
      "Ġexce": 2205,
      "Ġjoin": 2206,
      "Ġvideo": 2207,
      "Ġcent": 2208,
      "Ġwithout": 2209,
      "Thomson": 2210,
      "ories": 2211,
      "ese": 2212,
      "itig": 2213,
      "Ġtaking": 2214,
      "Ġremarks": 2215,
      "Ġindicates": 2216,
      "amer": 2217,
      "Ġgeneration": 2218,
      "bins": 2219,
      "ĠRobbins": 2220,
      "ĠSur": 2221,
      "Ġtrying": 2222,
      "cont": 2223,
      "Ġgeograph": 2224,
      "llar": 2225,
      "chie": 2226,
      "Ġongoing": 2227,
      "Ġmoving": 2228,
      "Ġdollar": 2229,
      "ront": 2230,
      "ences": 2231,
      "Ġregarding": 2232,
      "Ind": 2233,
      "ling": 2234,
      "sure": 2235,
      "yond": 2236,
      "anjay": 2237,
      "Ġlay": 2238,
      "endar": 2239,
      "Ġmeet": 2240,
      "Ġspace": 2241,
      "ĠSund": 2242,
      "Ġkeep": 2243,
      "Ġuncertainties": 2244,
      "15": 2245,
      "21": 2246,
      "Peter": 2247,
      "mental": 2248,
      "Ġansw": 2249,
      "Ġhelpful": 2250,
      "Ġtarget": 2251,
      "obert": 2252,
      "Independent": 2253,
      "ĠSundar": 2254,
      "dit": 2255,
      "reci": 2256,
      "ĠCPU": 2257,
      "Ġplus": 2258,
      "Ġunits": 2259,
      "Ġrev": 2260,
      "ety": 2261,
      "Ġtell": 2262,
      "Ġdevelopers": 2263,
      "25": 2264,
      "Ġachie": 2265,
      "enced": 2266,
      "accurate": 2267,
      "Ġoptim": 2268,
      "Ġcalendar": 2269,
      "Ġnormal": 2270,
      "BC": 2271,
      "lf": 2272,
      "Ġdef": 2273,
      "Ġtranscri": 2274,
      "ĠFinancial": 2275,
      "Tim": 2276,
      "Ġmain": 2277,
      "Ġglobal": 2278,
      "Ġever": 2279,
      "Ġconnect": 2280,
      "ĠIntern": 2281,
      "Ġexecution": 2282,
      "Ġworkloads": 2283,
      "Ġfair": 2284,
      "Ġguide": 2285,
      "Ġlog": 2286,
      "Ġapproach": 2287,
      "Ġsignificantly": 2288,
      "Ġupdate": 2289,
      "orrect": 2290,
      "Ġarea": 2291,
      "Ġsub": 2292,
      "Sure": 2293,
      "iss": 2294,
      "que": 2295,
      "aging": 2296,
      "Ġteams": 2297,
      "Ġsur": 2298,
      "Ġrequire": 2299,
      "Ġinstalled": 2300,
      "Ġhaving": 2301,
      "othy": 2302,
      "ĠEar": 2303,
      "Ġintellig": 2304,
      "ebook": 2305,
      "ĠInstructions": 2306,
      "14": 2307,
      "yz": 2308,
      "Ġmet": 2309,
      "che": 2310,
      "quarter": 2311,
      "Ġadj": 2312,
      "Ġhighl": 2313,
      "Ġcompetitive": 2314,
      "Ġsolid": 2315,
      "Ġfound": 2316,
      "ĠTim": 2317,
      "Ġcompared": 2318,
      "ĠJune": 2319,
      "Ġacquisition": 2320,
      "fact": 2321,
      "Ġrefer": 2322,
      "Ġbeyond": 2323,
      "iminary": 2324,
      "Ġdriver": 2325,
      "ĠRevenue": 2326,
      "Ġsubscription": 2327,
      "reliminary": 2328,
      "utsche": 2329,
      "rist": 2330,
      "ufact": 2331,
      "itz": 2332,
      "ilt": 2333,
      "Ġuser": 2334,
      "Ġvis": 2335,
      "eneration": 2336,
      "ĠASPs": 2337,
      "ĠOpEx": 2338,
      "ĠThese": 2339,
      "ĠJames": 2340,
      "Ġdevelopment": 2341,
      "Ġpartnership": 2342,
      "YC": 2343,
      "Ġmac": 2344,
      "Ġdivid": 2345,
      "Ġenab": 2346,
      "ĠEPYC": 2347,
      "Ġseasonal": 2348,
      "generation": 2349,
      "Ġcateg": 2350,
      "Ġorgan": 2351,
      "chnologies": 2352,
      "Ġretail": 2353,
      "Ġemp": 2354,
      "13": 2355,
      "cu": 2356,
      "hold": 2357,
      "ichael": 2358,
      "Ġlargest": 2359,
      "Ġdirect": 2360,
      "ĠInternet": 2361,
      "Ġdividend": 2362,
      "cos": 2363,
      "Ġcommun": 2364,
      "Ġmanufact": 2365,
      "Ġperson": 2366,
      "Ġdigital": 2367,
      "Ġes": 2368,
      "Ġstarted": 2369,
      "Ġanswer": 2370,
      "On": 2371,
      "ta": 2372,
      "ĠAss": 2373,
      "ette": 2374,
      "ĠOne": 2375,
      "Ġrates": 2376,
      "Ġprofitability": 2377,
      "Ġmeasures": 2378,
      "ex": 2379,
      "ership": 2380,
      "Ġexpense": 2381,
      "ĠJohn": 2382,
      "ĠUBS": 2383,
      "ktop": 2384,
      "Ġstep": 2385,
      "UBS": 2386,
      "ura": 2387,
      "Ġhop": 2388,
      "ĠRyz": 2389,
      "Ġtalking": 2390,
      "Ġconsistent": 2391,
      "Ġforecast": 2392,
      "ĠTo": 2393,
      "Ġtherefore": 2394,
      "ĠQu": 2395,
      "pecially": 2396,
      "Ġfar": 2397,
      "lcome": 2398,
      "ĠAct": 2399,
      "ĠPeter": 2400,
      "Ġshow": 2401,
      "Ġcomplet": 2402,
      "ĠWhile": 2403,
      "ince": 2404,
      "rop": 2405,
      "vercore": 2406,
      "Ġpublic": 2407,
      "Ġcenters": 2408,
      "rÃ": 2409,
